/* automatically generated by rust-bindgen 0.69.4 */

pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 38;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const SCIP_EXPRPRINT_EVALVALUE: u32 = 8;
pub const SCIP_EXPRPRINT_EVALTAG: u32 = 24;
pub const SCIP_EXPRPRINT_ACTIVITY: u32 = 32;
pub const SCIP_EXPRPRINT_ACTIVITYTAG: u32 = 96;
pub const SCIP_EXPRPRINT_OWNER: u32 = 128;
pub const SCIP_EXPRPRINT_ALL: u32 = 255;
pub const SCIP_NLPPARAM_DEFAULT_VERBLEVEL: u32 = 0;
pub const SCIP_DECOMP_LINKVAR: i32 = -1;
pub const SCIP_DECOMP_LINKCONS: i32 = -2;
pub const _STRING_H: u32 = 1;
pub const _BITS_TYPES_LOCALE_T_H: u32 = 1;
pub const _BITS_TYPES___LOCALE_T_H: u32 = 1;
pub const _STRINGS_H: u32 = 1;
pub const QUAD_EPSILON: f64 = 0.000000000001;
pub const SCIP_NLHDLR_METHOD_NONE: u32 = 0;
pub const SCIP_NLHDLR_METHOD_SEPABELOW: u32 = 1;
pub const SCIP_NLHDLR_METHOD_SEPAABOVE: u32 = 2;
pub const SCIP_NLHDLR_METHOD_SEPABOTH: u32 = 3;
pub const SCIP_NLHDLR_METHOD_ACTIVITY: u32 = 4;
pub const SCIP_NLHDLR_METHOD_ALL: u32 = 7;
pub const SCIP_MAXVERTEXPOLYDIM: u32 = 14;
pub const SYM_COMPUTETIMING_BEFOREPRESOL: u32 = 0;
pub const SYM_COMPUTETIMING_DURINGPRESOL: u32 = 1;
pub const SYM_COMPUTETIMING_AFTERPRESOL: u32 = 2;
pub const ARTIFICIALVARNAMEPREFIX: &[u8; 14] = b"andresultant_\0";
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_cookie_io_functions_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn __log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn __nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn __round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn __nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __fpclassifyl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinfl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitel(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnanl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsigl(__x: u128, __y: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn __atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn expl(__x: u128) -> u128;
}
extern "C" {
    pub fn __expl(__x: u128) -> u128;
}
extern "C" {
    pub fn frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn logl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logl(__x: u128) -> u128;
}
extern "C" {
    pub fn log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn __modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn __expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn __log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn __ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn __fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn __floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn isinfl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitel(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn __significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn isnanl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn __scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn __roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn __truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn lrintl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn __fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub fn __scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub const FP_NAN: _bindgen_ty_1 = 0;
pub const FP_INFINITE: _bindgen_ty_1 = 1;
pub const FP_ZERO: _bindgen_ty_1 = 2;
pub const FP_SUBNORMAL: _bindgen_ty_1 = 3;
pub const FP_NORMAL: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub fn __assert_fail(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    pub fn __assert_perror_fail(
        __errnum: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    pub fn __assert(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_int,
    ) -> !;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::std::mem::MaybeUninit<random_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::std::mem::MaybeUninit<drand48_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn arc4random() -> __uint32_t;
}
extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    #[doc = " allocates array and initializes it with 0; returns NULL if memory allocation failed"]
    pub fn BMSallocClearMemory_call(
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates memory; returns NULL if memory allocation failed"]
    pub fn BMSallocMemory_call(
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates array; returns NULL if memory allocation failed"]
    pub fn BMSallocMemoryArray_call(
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates memory; returns NULL if memory allocation failed"]
    pub fn BMSreallocMemory_call(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " reallocates array; returns NULL if memory allocation failed"]
    pub fn BMSreallocMemoryArray_call(
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " clears a memory element (i.e. fills it with zeros)"]
    pub fn BMSclearMemory_call(ptr: *mut ::std::os::raw::c_void, size: usize);
}
extern "C" {
    #[doc = " copies the contents of one memory element into another memory element"]
    pub fn BMScopyMemory_call(
        ptr: *mut ::std::os::raw::c_void,
        source: *const ::std::os::raw::c_void,
        size: usize,
    );
}
extern "C" {
    #[doc = " moves the contents of one memory element into another memory element, should be used if both elements overlap,\n  otherwise BMScopyMemory is faster"]
    pub fn BMSmoveMemory_call(
        ptr: *mut ::std::os::raw::c_void,
        source: *const ::std::os::raw::c_void,
        size: usize,
    );
}
extern "C" {
    #[doc = " allocates memory and copies the contents of the given memory element into the new memory element"]
    pub fn BMSduplicateMemory_call(
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates array and copies the contents of the given source array into the new array"]
    pub fn BMSduplicateMemoryArray_call(
        source: *const ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " frees an allocated memory element and sets pointer to NULL"]
    pub fn BMSfreeMemory_call(
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " frees an allocated memory element if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeMemoryNull_call(
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " returns the size of an allocated memory element"]
    pub fn BMSgetPointerSize_call(ptr: *const ::std::os::raw::c_void) -> usize;
}
extern "C" {
    #[doc = " outputs information about currently allocated memory to the screen"]
    pub fn BMSdisplayMemory_call();
}
extern "C" {
    #[doc = " displays a warning message on the screen, if allocated memory exists"]
    pub fn BMScheckEmptyMemory_call();
}
extern "C" {
    #[doc = " returns total number of allocated bytes"]
    pub fn BMSgetMemoryUsed_call() -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMS_ChkMem {
    _unused: [u8; 0],
}
#[doc = " Chunk Memory Management\n\n Efficient memory management for multiple objects of the same size"]
pub type BMS_CHKMEM = BMS_ChkMem;
extern "C" {
    #[doc = " aligns the given byte size corresponding to the minimal alignment for chunk and block memory"]
    pub fn BMSalignMemsize(size: *mut usize);
}
extern "C" {
    #[doc = " checks whether the given size meets the alignment conditions for chunk and block memory"]
    pub fn BMSisAligned(size: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " creates a new chunk block data structure"]
    pub fn BMScreateChunkMemory_call(
        size: usize,
        initchunksize: ::std::os::raw::c_int,
        garbagefactor: ::std::os::raw::c_int,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut BMS_CHKMEM;
}
extern "C" {
    #[doc = " clears a chunk block data structure"]
    pub fn BMSclearChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " destroys and frees a chunk block data structure"]
    pub fn BMSdestroyChunkMemory_call(
        chkmem: *mut *mut BMS_CHKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " allocates a memory element of the given chunk block"]
    pub fn BMSallocChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " duplicates a given memory element by allocating a new element of the same chunk block and copying the data"]
    pub fn BMSduplicateChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " frees a memory element of the given chunk block and sets pointer to NULL"]
    pub fn BMSfreeChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " frees a memory element of the given chunk block if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeChunkMemoryNull_call(
        chkmem: *mut BMS_CHKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " calls garbage collection of chunk block and frees chunks without allocated memory elements"]
    pub fn BMSgarbagecollectChunkMemory_call(chkmem: *mut BMS_CHKMEM);
}
extern "C" {
    #[doc = " returns the number of allocated bytes in the chunk block"]
    pub fn BMSgetChunkMemoryUsed_call(chkmem: *const BMS_CHKMEM) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMS_BlkMem {
    _unused: [u8; 0],
}
#[doc = " Block Memory Management\n\n Efficient memory management for objects of varying sizes"]
pub type BMS_BLKMEM = BMS_BlkMem;
extern "C" {
    #[doc = " creates a block memory allocation data structure"]
    pub fn BMScreateBlockMemory_call(
        initchunksize: ::std::os::raw::c_int,
        garbagefactor: ::std::os::raw::c_int,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut BMS_BLKMEM;
}
extern "C" {
    #[doc = " frees all chunk blocks in the block memory"]
    pub fn BMSclearBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " clears and deletes block memory"]
    pub fn BMSdestroyBlockMemory_call(
        blkmem: *mut *mut BMS_BLKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " allocates memory in the block memory pool"]
    pub fn BMSallocBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates memory in the block memory pool and clears it"]
    pub fn BMSallocClearBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates array in the block memory pool"]
    pub fn BMSallocBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates array in the block memory pool and clears it"]
    pub fn BMSallocClearBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " resizes memory element in the block memory pool and copies the data"]
    pub fn BMSreallocBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut ::std::os::raw::c_void,
        oldsize: usize,
        newsize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " resizes array in the block memory pool and copies the data"]
    pub fn BMSreallocBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut ::std::os::raw::c_void,
        oldnum: usize,
        newnum: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " duplicates memory element in the block memory pool and copies the data"]
    pub fn BMSduplicateBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " duplicates array in the block memory pool and copies the data"]
    pub fn BMSduplicateBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        source: *const ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " frees memory element in the block memory pool and sets pointer to NULL"]
    pub fn BMSfreeBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " frees memory element in the block memory pool if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeBlockMemoryNull_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " calls garbage collection of block memory, frees chunks without allocated memory elements, and frees\n  chunk blocks without any chunks"]
    pub fn BMSgarbagecollectBlockMemory_call(blkmem: *mut BMS_BLKMEM);
}
extern "C" {
    #[doc = " returns the number of allocated bytes in the block memory"]
    pub fn BMSgetBlockMemoryAllocated_call(blkmem: *const BMS_BLKMEM)
        -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " returns the number of used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUsed_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " returns the number of allocated but not used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUnused_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " returns the maximal number of used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUsedMax_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " returns the maximal number of allocated but not used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUnusedMax_call(blkmem: *const BMS_BLKMEM)
        -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " returns the maximal number of allocated bytes in the block memory"]
    pub fn BMSgetBlockMemoryAllocatedMax_call(
        blkmem: *const BMS_BLKMEM,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " returns the size of the given memory element; returns 0, if the element is not member of the block memory"]
    pub fn BMSgetBlockPointerSize_call(
        blkmem: *const BMS_BLKMEM,
        ptr: *const ::std::os::raw::c_void,
    ) -> usize;
}
extern "C" {
    #[doc = " outputs allocation diagnostics of block memory"]
    pub fn BMSdisplayBlockMemory_call(blkmem: *const BMS_BLKMEM);
}
extern "C" {
    #[doc = " outputs error messages, if there are allocated elements in the block memory and returns number of unfreed bytes"]
    pub fn BMScheckEmptyBlockMemory_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMS_BufMem {
    _unused: [u8; 0],
}
#[doc = " Buffer Memory Management\n\n Efficient memory management for temporary objects"]
pub type BMS_BUFMEM = BMS_BufMem;
extern "C" {
    #[doc = " creates memory buffer storage"]
    pub fn BMScreateBufferMemory_call(
        arraygrowfac: f64,
        arraygrowinit: ::std::os::raw::c_int,
        clean: ::std::os::raw::c_uint,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut BMS_BUFMEM;
}
extern "C" {
    #[doc = " destroys buffer memory"]
    pub fn BMSdestroyBufferMemory_call(
        buffer: *mut *mut BMS_BUFMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " set arraygrowfac"]
    pub fn BMSsetBufferMemoryArraygrowfac(buffer: *mut BMS_BUFMEM, arraygrowfac: f64);
}
extern "C" {
    #[doc = " set arraygrowinit"]
    pub fn BMSsetBufferMemoryArraygrowinit(
        buffer: *mut BMS_BUFMEM,
        arraygrowinit: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " allocates the next unused buffer"]
    pub fn BMSallocBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates the next unused buffer array"]
    pub fn BMSallocBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates the next unused buffer and clears it"]
    pub fn BMSallocClearBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " reallocates the buffer to at least the given size"]
    pub fn BMSreallocBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " reallocates an array in the buffer to at least the given size"]
    pub fn BMSreallocBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates the next unused buffer and copies the given memory into the buffer"]
    pub fn BMSduplicateBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " allocates an array in the next unused buffer and copies the given memory into the buffer"]
    pub fn BMSduplicateBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        source: *const ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " frees a buffer and sets pointer to NULL"]
    pub fn BMSfreeBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " frees a buffer if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeBufferMemoryNull_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " gets number of used buffers"]
    pub fn BMSgetNUsedBufferMemory(buffer: *mut BMS_BUFMEM) -> usize;
}
extern "C" {
    #[doc = " returns the number of allocated bytes in the buffer memory"]
    pub fn BMSgetBufferMemoryUsed(bufmem: *const BMS_BUFMEM) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " outputs statistics about currently allocated buffers to the screen"]
    pub fn BMSprintBufferMemory(buffer: *mut BMS_BUFMEM);
}
#[doc = "< normal termination"]
pub const SCIP_Retcode_SCIP_OKAY: SCIP_Retcode = 1;
#[doc = "< unspecified error"]
pub const SCIP_Retcode_SCIP_ERROR: SCIP_Retcode = 0;
#[doc = "< insufficient memory error"]
pub const SCIP_Retcode_SCIP_NOMEMORY: SCIP_Retcode = -1;
#[doc = "< read error"]
pub const SCIP_Retcode_SCIP_READERROR: SCIP_Retcode = -2;
#[doc = "< write error"]
pub const SCIP_Retcode_SCIP_WRITEERROR: SCIP_Retcode = -3;
#[doc = "< file not found error"]
pub const SCIP_Retcode_SCIP_NOFILE: SCIP_Retcode = -4;
#[doc = "< cannot create file"]
pub const SCIP_Retcode_SCIP_FILECREATEERROR: SCIP_Retcode = -5;
#[doc = "< error in LP solver"]
pub const SCIP_Retcode_SCIP_LPERROR: SCIP_Retcode = -6;
#[doc = "< no problem exists"]
pub const SCIP_Retcode_SCIP_NOPROBLEM: SCIP_Retcode = -7;
#[doc = "< method cannot be called at this time in solution process"]
pub const SCIP_Retcode_SCIP_INVALIDCALL: SCIP_Retcode = -8;
#[doc = "< error in input data"]
pub const SCIP_Retcode_SCIP_INVALIDDATA: SCIP_Retcode = -9;
#[doc = "< method returned an invalid result code"]
pub const SCIP_Retcode_SCIP_INVALIDRESULT: SCIP_Retcode = -10;
#[doc = "< a required plugin was not found"]
pub const SCIP_Retcode_SCIP_PLUGINNOTFOUND: SCIP_Retcode = -11;
#[doc = "< the parameter with the given name was not found"]
pub const SCIP_Retcode_SCIP_PARAMETERUNKNOWN: SCIP_Retcode = -12;
#[doc = "< the parameter is not of the expected type"]
pub const SCIP_Retcode_SCIP_PARAMETERWRONGTYPE: SCIP_Retcode = -13;
#[doc = "< the value is invalid for the given parameter"]
pub const SCIP_Retcode_SCIP_PARAMETERWRONGVAL: SCIP_Retcode = -14;
#[doc = "< the given key is already existing in table"]
pub const SCIP_Retcode_SCIP_KEYALREADYEXISTING: SCIP_Retcode = -15;
#[doc = "< maximal branching depth level exceeded"]
pub const SCIP_Retcode_SCIP_MAXDEPTHLEVEL: SCIP_Retcode = -16;
#[doc = "< no branching could be created"]
pub const SCIP_Retcode_SCIP_BRANCHERROR: SCIP_Retcode = -17;
#[doc = "< function not implemented"]
pub const SCIP_Retcode_SCIP_NOTIMPLEMENTED: SCIP_Retcode = -18;
#[doc = " return codes for SCIP methods: non-positive return codes are errors"]
pub type SCIP_Retcode = ::std::os::raw::c_int;
#[doc = " return codes for SCIP methods: non-positive return codes are errors"]
pub use self::SCIP_Retcode as SCIP_RETCODE;
#[doc = "< the method was not executed"]
pub const SCIP_Result_SCIP_DIDNOTRUN: SCIP_Result = 1;
#[doc = "< the method was not executed, but should be called again later"]
pub const SCIP_Result_SCIP_DELAYED: SCIP_Result = 2;
#[doc = "< the method was executed, but failed finding anything"]
pub const SCIP_Result_SCIP_DIDNOTFIND: SCIP_Result = 3;
#[doc = "< no infeasibility could be found"]
pub const SCIP_Result_SCIP_FEASIBLE: SCIP_Result = 4;
#[doc = "< an infeasibility was detected"]
pub const SCIP_Result_SCIP_INFEASIBLE: SCIP_Result = 5;
#[doc = "< an unboundedness was detected"]
pub const SCIP_Result_SCIP_UNBOUNDED: SCIP_Result = 6;
#[doc = "< the current node is infeasible and can be cut off"]
pub const SCIP_Result_SCIP_CUTOFF: SCIP_Result = 7;
#[doc = "< the method added a cutting plane"]
pub const SCIP_Result_SCIP_SEPARATED: SCIP_Result = 8;
#[doc = "< the method added a cutting plane and a new separation round should immediately start"]
pub const SCIP_Result_SCIP_NEWROUND: SCIP_Result = 9;
#[doc = "< the method reduced the domain of a variable"]
pub const SCIP_Result_SCIP_REDUCEDDOM: SCIP_Result = 10;
#[doc = "< the method added a constraint"]
pub const SCIP_Result_SCIP_CONSADDED: SCIP_Result = 11;
#[doc = "< the method changed a constraint"]
pub const SCIP_Result_SCIP_CONSCHANGED: SCIP_Result = 12;
#[doc = "< the method created a branching"]
pub const SCIP_Result_SCIP_BRANCHED: SCIP_Result = 13;
#[doc = "< the current node's LP must be solved"]
pub const SCIP_Result_SCIP_SOLVELP: SCIP_Result = 14;
#[doc = "< the method found a feasible primal solution"]
pub const SCIP_Result_SCIP_FOUNDSOL: SCIP_Result = 15;
#[doc = "< the method interrupted its execution, but can continue if needed"]
pub const SCIP_Result_SCIP_SUSPENDED: SCIP_Result = 16;
#[doc = "< the method was successfully executed"]
pub const SCIP_Result_SCIP_SUCCESS: SCIP_Result = 17;
#[doc = "< the processing of the branch-and-bound node should stopped and continued later"]
pub const SCIP_Result_SCIP_DELAYNODE: SCIP_Result = 18;
#[doc = " result codes for SCIP callback methods"]
pub type SCIP_Result = ::std::os::raw::c_uint;
#[doc = " result codes for SCIP callback methods"]
pub use self::SCIP_Result as SCIP_RESULT;
#[doc = "< use default clock type"]
pub const SCIP_ClockType_SCIP_CLOCKTYPE_DEFAULT: SCIP_ClockType = 0;
#[doc = "< use CPU clock"]
pub const SCIP_ClockType_SCIP_CLOCKTYPE_CPU: SCIP_ClockType = 1;
#[doc = "< use wall clock"]
pub const SCIP_ClockType_SCIP_CLOCKTYPE_WALL: SCIP_ClockType = 2;
pub type SCIP_ClockType = ::std::os::raw::c_uint;
pub use self::SCIP_ClockType as SCIP_CLOCKTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Clock {
    _unused: [u8; 0],
}
pub type SCIP_CLOCK = SCIP_Clock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_CPUClock {
    _unused: [u8; 0],
}
pub type SCIP_CPUCLOCK = SCIP_CPUClock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_WallClock {
    _unused: [u8; 0],
}
pub type SCIP_WALLCLOCK = SCIP_WallClock;
#[doc = "< one-sided confidence level 75 %, two-sided 50 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_MIN: SCIP_Confidencelevel = 0;
#[doc = "< (one-sided) confidence level 87.5 %, two-sided 75 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_LOW: SCIP_Confidencelevel = 1;
#[doc = "< (one-sided) confidence level 90 %, two-sided 80 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_MEDIUM: SCIP_Confidencelevel = 2;
#[doc = "< (one-sided) confidence level 95 %, two-sided 90 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_HIGH: SCIP_Confidencelevel = 3;
#[doc = "< (one-sided) confidence level 97.5 %, two-sided 95 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_MAX: SCIP_Confidencelevel = 4;
#[doc = " represents different confidence levels for (one-sided) hypothesis testing; in order to obtain two-sided confidence\n  levels, calculate 2 * c - 1, i.e., if the one-sided confidence level is 90 %, the two-sided level is 80 %"]
pub type SCIP_Confidencelevel = ::std::os::raw::c_uint;
#[doc = " represents different confidence levels for (one-sided) hypothesis testing; in order to obtain two-sided confidence\n  levels, calculate 2 * c - 1, i.e., if the one-sided confidence level is 90 %, the two-sided level is 80 %"]
pub use self::SCIP_Confidencelevel as SCIP_CONFIDENCELEVEL;
#[doc = "< the hashmap did not store a single element yet, type unknown"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_UNKNOWN: SCIP_Hashmaptype = 0;
#[doc = "< the hashmap stores pointers %"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_POINTER: SCIP_Hashmaptype = 1;
#[doc = "< the hashmap stores reals"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_REAL: SCIP_Hashmaptype = 2;
#[doc = "< the hashmap stores ints"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_INT: SCIP_Hashmaptype = 3;
#[doc = " type of hashmap: are pointers, reals or ints stored, or unknown"]
pub type SCIP_Hashmaptype = ::std::os::raw::c_uint;
#[doc = " type of hashmap: are pointers, reals or ints stored, or unknown"]
pub use self::SCIP_Hashmaptype as SCIP_HASHMAPTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SparseSol {
    _unused: [u8; 0],
}
#[doc = " Sparse solution data structure\n\n  - \\ref SparseSol \"List of all available methods\""]
pub type SCIP_SPARSESOL = SCIP_SparseSol;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Queue {
    _unused: [u8; 0],
}
#[doc = " (circular) Queue data structure\n\n  - \\ref Queue \"List of all available methods\""]
pub type SCIP_QUEUE = SCIP_Queue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PQueue {
    _unused: [u8; 0],
}
#[doc = " Priority queue data structure\n\n  - \\ref PriorityQueue \"List of all available methods\""]
pub type SCIP_PQUEUE = SCIP_PQueue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashTable {
    _unused: [u8; 0],
}
#[doc = " Hash table data structure\n\n  - \\ref HashTable \"List of all available methods\""]
pub type SCIP_HASHTABLE = SCIP_HashTable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_MultiHash {
    _unused: [u8; 0],
}
#[doc = " Hash table data structure which allows multiple occurences of an element\n\n  - \\ref MultiHash \"List of all available methods\""]
pub type SCIP_MULTIHASH = SCIP_MultiHash;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_MultiHashList {
    _unused: [u8; 0],
}
#[doc = " Hash table element list to store single elements of a multi hash table"]
pub type SCIP_MULTIHASHLIST = SCIP_MultiHashList;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashMapEntry {
    _unused: [u8; 0],
}
#[doc = " Hash map entry"]
pub type SCIP_HASHMAPENTRY = SCIP_HashMapEntry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashMap {
    _unused: [u8; 0],
}
#[doc = " Hash map data structure\n\n  - \\ref HashMap \"List of all available methods\""]
pub type SCIP_HASHMAP = SCIP_HashMap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashSet {
    _unused: [u8; 0],
}
#[doc = " Hash set data structure\n\n  - \\ref HashMap \"List of all available methods\""]
pub type SCIP_HASHSET = SCIP_HashSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RealArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing SCIP_Real values"]
pub type SCIP_REALARRAY = SCIP_RealArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_IntArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing int values"]
pub type SCIP_INTARRAY = SCIP_IntArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BoolArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing SCIP_Bool values"]
pub type SCIP_BOOLARRAY = SCIP_BoolArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PtrArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing pointers"]
pub type SCIP_PTRARRAY = SCIP_PtrArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RandNumGen {
    _unused: [u8; 0],
}
#[doc = " random number generator"]
pub type SCIP_RANDNUMGEN = SCIP_RandNumGen;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ResourceActivity {
    _unused: [u8; 0],
}
#[doc = " Resource activity data structure\n\n  - \\ref ResourceActivity \"List of all available methods\""]
pub type SCIP_RESOURCEACTIVITY = SCIP_ResourceActivity;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Profile {
    _unused: [u8; 0],
}
#[doc = " Resource profile data structure\n\n  - \\ref ResourceProfile \"List of all available methods\""]
pub type SCIP_PROFILE = SCIP_Profile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Digraph {
    _unused: [u8; 0],
}
#[doc = " Directed graph data structure (stored as adjacency list)\n\n  - \\ref DirectedGraph \"List of all available methods\""]
pub type SCIP_DIGRAPH = SCIP_Digraph;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Bt {
    _unused: [u8; 0],
}
#[doc = " Binary tree data structure\n\n  - \\ref BinaryTree \"List of all available methods\""]
pub type SCIP_BT = SCIP_Bt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BtNode {
    _unused: [u8; 0],
}
#[doc = " search node of \\ref SCIP_BT \"binary tree\""]
pub type SCIP_BTNODE = SCIP_BtNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Regression {
    _unused: [u8; 0],
}
#[doc = " regression data structure to compute an incremental linear regression of paired observations\n\n  - \\ref Regression \"List of all available methods\""]
pub type SCIP_REGRESSION = SCIP_Regression;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DisjointSet {
    _unused: [u8; 0],
}
#[doc = " disjoint set (disjoint set (union find)) data structure for querying and updating connectedness of a graph with integer vertices 0,...,n - 1\n\n  - \\ref DisjointSet \"List of available methods\""]
pub type SCIP_DISJOINTSET = SCIP_DisjointSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RowPrep {
    _unused: [u8; 0],
}
#[doc = " a linear inequality row in preparation to become a SCIP_ROW\n\n Used to assemble data that could eventually make a SCIP_ROW.\n @note Only one-sided rows are allowed here."]
pub type SCIP_ROWPREP = SCIP_RowPrep;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Scip {
    _unused: [u8; 0],
}
pub type SCIP = Scip;
pub type SCIP_PRESOLTIMING = ::std::os::raw::c_uint;
pub type SCIP_PROPTIMING = ::std::os::raw::c_uint;
pub type SCIP_HEURTIMING = ::std::os::raw::c_uint;
#[doc = "< bool values: TRUE or FALSE"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_BOOL: SCIP_ParamType = 0;
#[doc = "< integer values"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_INT: SCIP_ParamType = 1;
#[doc = "< long integer values"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_LONGINT: SCIP_ParamType = 2;
#[doc = "< real values"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_REAL: SCIP_ParamType = 3;
#[doc = "< characters"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_CHAR: SCIP_ParamType = 4;
#[doc = "< strings: arrays of characters"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_STRING: SCIP_ParamType = 5;
#[doc = " possible parameter types"]
pub type SCIP_ParamType = ::std::os::raw::c_uint;
#[doc = " possible parameter types"]
pub use self::SCIP_ParamType as SCIP_PARAMTYPE;
#[doc = "< use default values"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_DEFAULT: SCIP_ParamSetting = 0;
#[doc = "< set to aggressive settings"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_AGGRESSIVE: SCIP_ParamSetting = 1;
#[doc = "< set to fast settings"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_FAST: SCIP_ParamSetting = 2;
#[doc = "< turn off"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_OFF: SCIP_ParamSetting = 3;
#[doc = " possible parameter settings - used to determine the behavior of different SCIP components, e.g., heuristics, separators, ..."]
pub type SCIP_ParamSetting = ::std::os::raw::c_uint;
#[doc = " possible parameter settings - used to determine the behavior of different SCIP components, e.g., heuristics, separators, ..."]
pub use self::SCIP_ParamSetting as SCIP_PARAMSETTING;
#[doc = "< use default values"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_DEFAULT: SCIP_ParamEmphasis = 0;
#[doc = "< get CP like search (e.g. no LP relaxation)"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_CPSOLVER: SCIP_ParamEmphasis = 1;
#[doc = "< solve easy problems fast"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_EASYCIP: SCIP_ParamEmphasis = 2;
#[doc = "< detect feasibility fast"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_FEASIBILITY: SCIP_ParamEmphasis = 3;
#[doc = "< be capable to handle hard LPs"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_HARDLP: SCIP_ParamEmphasis = 4;
#[doc = "< prove optimality fast"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_OPTIMALITY: SCIP_ParamEmphasis = 5;
#[doc = "< get a feasible and \"fast\" counting process"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_COUNTER: SCIP_ParamEmphasis = 6;
#[doc = "< feasibility phase settings during 3-phase solving approach"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_PHASEFEAS: SCIP_ParamEmphasis = 7;
#[doc = "< improvement phase settings during 3-phase solving approach"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_PHASEIMPROVE: SCIP_ParamEmphasis = 8;
#[doc = "< proof phase settings during 3-phase solving approach"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_PHASEPROOF: SCIP_ParamEmphasis = 9;
#[doc = "< emphasis parameters for increased numerical safety"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_NUMERICS: SCIP_ParamEmphasis = 10;
#[doc = "< do not try to avoid running into memory limit"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_BENCHMARK: SCIP_ParamEmphasis = 11;
#[doc = " possible parameter emphases - used to determine the general SCIP behavior"]
pub type SCIP_ParamEmphasis = ::std::os::raw::c_uint;
#[doc = " possible parameter emphases - used to determine the general SCIP behavior"]
pub use self::SCIP_ParamEmphasis as SCIP_PARAMEMPHASIS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Param {
    _unused: [u8; 0],
}
pub type SCIP_PARAM = SCIP_Param;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ParamData {
    _unused: [u8; 0],
}
pub type SCIP_PARAMDATA = SCIP_ParamData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ParamSet {
    _unused: [u8; 0],
}
pub type SCIP_PARAMSET = SCIP_ParamSet;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<imaxdiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type SCIP_EVENTTYPE = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Eventhdlr {
    _unused: [u8; 0],
}
pub type SCIP_EVENTHDLR = SCIP_Eventhdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventhdlrData {
    _unused: [u8; 0],
}
pub type SCIP_EVENTHDLRDATA = SCIP_EventhdlrData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Event {
    _unused: [u8; 0],
}
pub type SCIP_EVENT = SCIP_Event;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarAdded {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARADDED = SCIP_EventVarAdded;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarDeleted {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARDELETED = SCIP_EventVarDeleted;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarFixed {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARFIXED = SCIP_EventVarFixed;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarUnlocked {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARUNLOCKED = SCIP_EventVarUnlocked;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventObjChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTOBJCHG = SCIP_EventObjChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventBdChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTBDCHG = SCIP_EventBdChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventHole {
    _unused: [u8; 0],
}
pub type SCIP_EVENTHOLE = SCIP_EventHole;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventImplAdd {
    _unused: [u8; 0],
}
pub type SCIP_EVENTIMPLADD = SCIP_EventImplAdd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventTypeChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTTYPECHG = SCIP_EventTypeChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowAddedSepa {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWADDEDSEPA = SCIP_EventRowAddedSepa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowDeletedSepa {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWDELETEDSEPA = SCIP_EventRowDeletedSepa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowAddedLP {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWADDEDLP = SCIP_EventRowAddedLP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowDeletedLP {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWDELETEDLP = SCIP_EventRowDeletedLP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowCoefChanged {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWCOEFCHANGED = SCIP_EventRowCoefChanged;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowConstChanged {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWCONSTCHANGED = SCIP_EventRowConstChanged;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowSideChanged {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWSIDECHANGED = SCIP_EventRowSideChanged;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventData {
    _unused: [u8; 0],
}
pub type SCIP_EVENTDATA = SCIP_EventData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventFilter {
    _unused: [u8; 0],
}
pub type SCIP_EVENTFILTER = SCIP_EventFilter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventQueue {
    _unused: [u8; 0],
}
pub type SCIP_EVENTQUEUE = SCIP_EventQueue;
#[doc = "< LP was not solved, no solution exists"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_NOTSOLVED: SCIP_LPSolStat = 0;
#[doc = "< LP was solved to optimality"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_OPTIMAL: SCIP_LPSolStat = 1;
#[doc = "< LP is primal infeasible"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_INFEASIBLE: SCIP_LPSolStat = 2;
#[doc = "< LP has a primal unbounded ray"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_UNBOUNDEDRAY: SCIP_LPSolStat = 3;
#[doc = "< objective limit was reached during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_OBJLIMIT: SCIP_LPSolStat = 4;
#[doc = "< iteration limit was reached during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_ITERLIMIT: SCIP_LPSolStat = 5;
#[doc = "< time limit was reached during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_TIMELIMIT: SCIP_LPSolStat = 6;
#[doc = "< an error occured during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_ERROR: SCIP_LPSolStat = 7;
#[doc = " solution status after solving LP"]
pub type SCIP_LPSolStat = ::std::os::raw::c_uint;
#[doc = " solution status after solving LP"]
pub use self::SCIP_LPSolStat as SCIP_LPSOLSTAT;
#[doc = "< lower bound"]
pub const SCIP_BoundType_SCIP_BOUNDTYPE_LOWER: SCIP_BoundType = 0;
#[doc = "< upper bound"]
pub const SCIP_BoundType_SCIP_BOUNDTYPE_UPPER: SCIP_BoundType = 1;
#[doc = " type of variable bound: lower or upper bound"]
pub type SCIP_BoundType = ::std::os::raw::c_uint;
#[doc = " type of variable bound: lower or upper bound"]
pub use self::SCIP_BoundType as SCIP_BOUNDTYPE;
#[doc = "< left hand side"]
pub const SCIP_SideType_SCIP_SIDETYPE_LEFT: SCIP_SideType = 0;
#[doc = "< right hand side"]
pub const SCIP_SideType_SCIP_SIDETYPE_RIGHT: SCIP_SideType = 1;
#[doc = " type of row side: left hand or right hand side"]
pub type SCIP_SideType = ::std::os::raw::c_uint;
#[doc = " type of row side: left hand or right hand side"]
pub use self::SCIP_SideType as SCIP_SIDETYPE;
#[doc = "< unspecified origin of row"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_UNSPEC: SCIP_RowOriginType = 0;
#[doc = "< row created by a constraint handler"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_CONSHDLR: SCIP_RowOriginType = 1;
#[doc = "< row created by a constraint"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_CONS: SCIP_RowOriginType = 2;
#[doc = "< row created by separator"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_SEPA: SCIP_RowOriginType = 3;
#[doc = "< row created by reoptimization"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_REOPT: SCIP_RowOriginType = 4;
#[doc = " type of origin of row"]
pub type SCIP_RowOriginType = ::std::os::raw::c_uint;
#[doc = " type of origin of row"]
pub use self::SCIP_RowOriginType as SCIP_ROWORIGINTYPE;
#[doc = "< primal simplex"]
pub const SCIP_LPAlgo_SCIP_LPALGO_PRIMALSIMPLEX: SCIP_LPAlgo = 0;
#[doc = "< dual simplex"]
pub const SCIP_LPAlgo_SCIP_LPALGO_DUALSIMPLEX: SCIP_LPAlgo = 1;
#[doc = "< barrier algorithm"]
pub const SCIP_LPAlgo_SCIP_LPALGO_BARRIER: SCIP_LPAlgo = 2;
#[doc = "< barrier algorithm with crossover"]
pub const SCIP_LPAlgo_SCIP_LPALGO_BARRIERCROSSOVER: SCIP_LPAlgo = 3;
#[doc = " type of LP algorithm"]
pub type SCIP_LPAlgo = ::std::os::raw::c_uint;
#[doc = " type of LP algorithm"]
pub use self::SCIP_LPAlgo as SCIP_LPALGO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ColSolVals {
    _unused: [u8; 0],
}
pub type SCIP_COLSOLVALS = SCIP_ColSolVals;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RowSolVals {
    _unused: [u8; 0],
}
pub type SCIP_ROWSOLVALS = SCIP_RowSolVals;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_LpSolVals {
    _unused: [u8; 0],
}
pub type SCIP_LPSOLVALS = SCIP_LpSolVals;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Col {
    _unused: [u8; 0],
}
#[doc = " column of an LP\n\n  - \\ref PublicColumnMethods \"List of all available methods\""]
pub type SCIP_COL = SCIP_Col;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Row {
    _unused: [u8; 0],
}
#[doc = " row of an LP\n\n  - \\ref PublicRowMethods \"List of all available methods\""]
pub type SCIP_ROW = SCIP_Row;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Lp {
    _unused: [u8; 0],
}
#[doc = " LP structure\n\n  - \\ref PublicLPMethods \"List of all available methods\""]
pub type SCIP_LP = SCIP_Lp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlRow {
    _unused: [u8; 0],
}
pub type SCIP_NLROW = SCIP_NlRow;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Nlp {
    _unused: [u8; 0],
}
pub type SCIP_NLP = SCIP_Nlp;
#[doc = "< variable belongs to original problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_ORIGINAL: SCIP_Varstatus = 0;
#[doc = "< variable is a loose variable of the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_LOOSE: SCIP_Varstatus = 1;
#[doc = "< variable is a column of the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_COLUMN: SCIP_Varstatus = 2;
#[doc = "< variable is fixed to specific value in the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_FIXED: SCIP_Varstatus = 3;
#[doc = "< variable is aggregated to x = a*y + c in the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_AGGREGATED: SCIP_Varstatus = 4;
#[doc = "< variable is aggregated to x = a_1*y_1 + ... + a_k*y_k + c"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_MULTAGGR: SCIP_Varstatus = 5;
#[doc = "< variable is the negation of an original or transformed variable"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_NEGATED: SCIP_Varstatus = 6;
#[doc = " status of problem variables"]
pub type SCIP_Varstatus = ::std::os::raw::c_uint;
#[doc = " status of problem variables"]
pub use self::SCIP_Varstatus as SCIP_VARSTATUS;
#[doc = "< binary variable: \\f$ x \\in \\{0,1\\} \\f$"]
pub const SCIP_Vartype_SCIP_VARTYPE_BINARY: SCIP_Vartype = 0;
#[doc = "< integer variable: \\f$ x in \\{lb, \\dots, ub\\} \\f$"]
pub const SCIP_Vartype_SCIP_VARTYPE_INTEGER: SCIP_Vartype = 1;
#[doc = "< continuous variable with optional integrality restriction:\nassigning a fractional value for the variable is feasible and the solver will not enforce\nintegrality for this variable, but it may treat the variable as if an additional integrality\nrestriction exists in certain cases, e.g., during boundtightening;\ntypically, this variable type is used for implicit integer variables, that is, variables which\nare known to take an integral value in a feasible or optimal solution due to other constraints or\noptimality conditions"]
pub const SCIP_Vartype_SCIP_VARTYPE_IMPLINT: SCIP_Vartype = 2;
#[doc = "< continuous variable: \\f$ lb \\leq x \\leq ub \\f$"]
pub const SCIP_Vartype_SCIP_VARTYPE_CONTINUOUS: SCIP_Vartype = 3;
#[doc = " variable type"]
pub type SCIP_Vartype = ::std::os::raw::c_uint;
#[doc = " variable type"]
pub use self::SCIP_Vartype as SCIP_VARTYPE;
#[doc = "< dynamic bound changes with size information of arrays"]
pub const SCIP_DomchgType_SCIP_DOMCHGTYPE_DYNAMIC: SCIP_DomchgType = 0;
#[doc = "< static domain changes: number of entries equals size of arrays"]
pub const SCIP_DomchgType_SCIP_DOMCHGTYPE_BOTH: SCIP_DomchgType = 1;
#[doc = "< static domain changes without any hole changes"]
pub const SCIP_DomchgType_SCIP_DOMCHGTYPE_BOUND: SCIP_DomchgType = 2;
#[doc = " domain change data type"]
pub type SCIP_DomchgType = ::std::os::raw::c_uint;
#[doc = " domain change data type"]
pub use self::SCIP_DomchgType as SCIP_DOMCHGTYPE;
#[doc = "< bound change was due to a branching decision"]
pub const SCIP_BoundchgType_SCIP_BOUNDCHGTYPE_BRANCHING: SCIP_BoundchgType = 0;
#[doc = "< bound change was due to an inference of a constraint (domain propagation)"]
pub const SCIP_BoundchgType_SCIP_BOUNDCHGTYPE_CONSINFER: SCIP_BoundchgType = 1;
#[doc = "< bound change was due to an inference of a domain propagator"]
pub const SCIP_BoundchgType_SCIP_BOUNDCHGTYPE_PROPINFER: SCIP_BoundchgType = 2;
#[doc = " bound change type"]
pub type SCIP_BoundchgType = ::std::os::raw::c_uint;
#[doc = " bound change type"]
pub use self::SCIP_BoundchgType as SCIP_BOUNDCHGTYPE;
#[doc = "< variable locks for model and check constraints"]
pub const SCIP_LockType_SCIP_LOCKTYPE_MODEL: SCIP_LockType = 0;
#[doc = "< variable locks for conflict constraints"]
pub const SCIP_LockType_SCIP_LOCKTYPE_CONFLICT: SCIP_LockType = 1;
pub type SCIP_LockType = ::std::os::raw::c_uint;
pub use self::SCIP_LockType as SCIP_LOCKTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomChgBound {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHGBOUND = SCIP_DomChgBound;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomChgBoth {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHGBOTH = SCIP_DomChgBoth;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomChgDyn {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHGDYN = SCIP_DomChgDyn;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SCIP_DomChg {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHG = SCIP_DomChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BoundChg {
    _unused: [u8; 0],
}
pub type SCIP_BOUNDCHG = SCIP_BoundChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BdChgIdx {
    _unused: [u8; 0],
}
pub type SCIP_BDCHGIDX = SCIP_BdChgIdx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BdChgInfo {
    _unused: [u8; 0],
}
pub type SCIP_BDCHGINFO = SCIP_BdChgInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BranchingData {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHINGDATA = SCIP_BranchingData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_InferenceData {
    _unused: [u8; 0],
}
pub type SCIP_INFERENCEDATA = SCIP_InferenceData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HoleChg {
    _unused: [u8; 0],
}
pub type SCIP_HOLECHG = SCIP_HoleChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Hole {
    _unused: [u8; 0],
}
pub type SCIP_HOLE = SCIP_Hole;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Holelist {
    _unused: [u8; 0],
}
pub type SCIP_HOLELIST = SCIP_Holelist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Dom {
    _unused: [u8; 0],
}
pub type SCIP_DOM = SCIP_Dom;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Original {
    _unused: [u8; 0],
}
pub type SCIP_ORIGINAL = SCIP_Original;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Aggregate {
    _unused: [u8; 0],
}
pub type SCIP_AGGREGATE = SCIP_Aggregate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Multaggr {
    _unused: [u8; 0],
}
pub type SCIP_MULTAGGR = SCIP_Multaggr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Negate {
    _unused: [u8; 0],
}
pub type SCIP_NEGATE = SCIP_Negate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Var {
    _unused: [u8; 0],
}
pub type SCIP_VAR = SCIP_Var;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_VarData {
    _unused: [u8; 0],
}
pub type SCIP_VARDATA = SCIP_VarData;
#[doc = "< maximization of objective function"]
pub const SCIP_Objsense_SCIP_OBJSENSE_MAXIMIZE: SCIP_Objsense = -1;
#[doc = "< minimization of objective function (the default)"]
pub const SCIP_Objsense_SCIP_OBJSENSE_MINIMIZE: SCIP_Objsense = 1;
#[doc = " objective sense: minimization or maximization"]
pub type SCIP_Objsense = ::std::os::raw::c_int;
#[doc = " objective sense: minimization or maximization"]
pub use self::SCIP_Objsense as SCIP_OBJSENSE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Prob {
    _unused: [u8; 0],
}
pub type SCIP_PROB = SCIP_Prob;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ProbData {
    _unused: [u8; 0],
}
pub type SCIP_PROBDATA = SCIP_ProbData;
#[doc = "< the focus node, whose data is stored in the tree data structure"]
pub const SCIP_NodeType_SCIP_NODETYPE_FOCUSNODE: SCIP_NodeType = 0;
#[doc = "< temporary child node of the focus or refocused node used for probing"]
pub const SCIP_NodeType_SCIP_NODETYPE_PROBINGNODE: SCIP_NodeType = 1;
#[doc = "< unsolved sibling of the focus node"]
pub const SCIP_NodeType_SCIP_NODETYPE_SIBLING: SCIP_NodeType = 2;
#[doc = "< unsolved child of the focus node"]
pub const SCIP_NodeType_SCIP_NODETYPE_CHILD: SCIP_NodeType = 3;
#[doc = "< unsolved leaf of the tree, stored in the tree's queue"]
pub const SCIP_NodeType_SCIP_NODETYPE_LEAF: SCIP_NodeType = 4;
#[doc = "< temporary type of focus node, if it was solved completely"]
pub const SCIP_NodeType_SCIP_NODETYPE_DEADEND: SCIP_NodeType = 5;
#[doc = "< fork without LP solution"]
pub const SCIP_NodeType_SCIP_NODETYPE_JUNCTION: SCIP_NodeType = 6;
#[doc = "< fork without LP solution and added rows and columns"]
pub const SCIP_NodeType_SCIP_NODETYPE_PSEUDOFORK: SCIP_NodeType = 7;
#[doc = "< fork with solved LP and added rows and columns"]
pub const SCIP_NodeType_SCIP_NODETYPE_FORK: SCIP_NodeType = 8;
#[doc = "< fork with solved LP and arbitrarily changed rows and columns"]
pub const SCIP_NodeType_SCIP_NODETYPE_SUBROOT: SCIP_NodeType = 9;
#[doc = "< junction, fork, or subroot that was refocused for domain propagation"]
pub const SCIP_NodeType_SCIP_NODETYPE_REFOCUSNODE: SCIP_NodeType = 10;
pub type SCIP_NodeType = ::std::os::raw::c_uint;
pub use self::SCIP_NodeType as SCIP_NODETYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Probingnode {
    _unused: [u8; 0],
}
pub type SCIP_PROBINGNODE = SCIP_Probingnode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Sibling {
    _unused: [u8; 0],
}
pub type SCIP_SIBLING = SCIP_Sibling;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Child {
    _unused: [u8; 0],
}
pub type SCIP_CHILD = SCIP_Child;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Leaf {
    _unused: [u8; 0],
}
pub type SCIP_LEAF = SCIP_Leaf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Junction {
    _unused: [u8; 0],
}
pub type SCIP_JUNCTION = SCIP_Junction;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Pseudofork {
    _unused: [u8; 0],
}
pub type SCIP_PSEUDOFORK = SCIP_Pseudofork;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Fork {
    _unused: [u8; 0],
}
pub type SCIP_FORK = SCIP_Fork;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Subroot {
    _unused: [u8; 0],
}
pub type SCIP_SUBROOT = SCIP_Subroot;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Node {
    _unused: [u8; 0],
}
pub type SCIP_NODE = SCIP_Node;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PendingBdchg {
    _unused: [u8; 0],
}
pub type SCIP_PENDINGBDCHG = SCIP_PendingBdchg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Tree {
    _unused: [u8; 0],
}
pub type SCIP_TREE = SCIP_Tree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Bandit {
    _unused: [u8; 0],
}
#[doc = " data structure for bandit algorithms"]
pub type SCIP_BANDIT = SCIP_Bandit;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BanditVTable {
    _unused: [u8; 0],
}
#[doc = " virtual function table for bandit callbacks"]
pub type SCIP_BANDITVTABLE = SCIP_BanditVTable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BanditData {
    _unused: [u8; 0],
}
#[doc = " data structure for specific bandit algorithm implementation"]
pub type SCIP_BANDITDATA = SCIP_BanditData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BranchCand {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHCAND = SCIP_BranchCand;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Branchrule {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHRULE = SCIP_Branchrule;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BranchruleData {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHRULEDATA = SCIP_BranchruleData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Treemodel {
    _unused: [u8; 0],
}
pub type SCIP_TREEMODEL = SCIP_Treemodel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Conflicthdlr {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTHDLR = SCIP_Conflicthdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConflicthdlrData {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTHDLRDATA = SCIP_ConflicthdlrData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConflictSet {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTSET = SCIP_ConflictSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ProofSet {
    _unused: [u8; 0],
}
pub type SCIP_PROOFSET = SCIP_ProofSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_LPBdChgs {
    _unused: [u8; 0],
}
pub type SCIP_LPBDCHGS = SCIP_LPBdChgs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Conflict {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICT = SCIP_Conflict;
#[doc = "< unknown type"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_UNKNOWN: SCIP_ConflictType = 0;
#[doc = "< conflict results from propagation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_PROPAGATION: SCIP_ConflictType = 1;
#[doc = "< conflict results from an infeasible LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_INFEASLP: SCIP_ConflictType = 2;
#[doc = "< conflict results from a boundexceeding LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_BNDEXCEEDING: SCIP_ConflictType = 3;
#[doc = "< alternative proof of an infeasible LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_ALTINFPROOF: SCIP_ConflictType = 4;
#[doc = "< alternative proof of a boundexceeding LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_ALTBNDPROOF: SCIP_ConflictType = 5;
#[doc = " types of conflicts"]
pub type SCIP_ConflictType = ::std::os::raw::c_uint;
#[doc = " types of conflicts"]
pub use self::SCIP_ConflictType as SCIP_CONFTYPE;
#[doc = "< no presolving"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_DISABLED: SCIP_ConflictPresolStrat = 0;
#[doc = "< keep variables contributing with its local bound"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_ONLYLOCAL: SCIP_ConflictPresolStrat = 1;
#[doc = "< keep variables contributing with its global bound"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_ONLYGLOBAL: SCIP_ConflictPresolStrat = 2;
#[doc = "< keep variables contributing with its global bound and add a few\n   variables contributing with its local bound such that the\n   constraint is not globally redundant"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_BOTH: SCIP_ConflictPresolStrat = 3;
#[doc = " dualray presolving strategy"]
pub type SCIP_ConflictPresolStrat = ::std::os::raw::c_uint;
#[doc = " dualray presolving strategy"]
pub use self::SCIP_ConflictPresolStrat as SCIP_CONFPRES;
#[doc = "< solution describes original variables; non-cached elements are zero"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_ORIGINAL: SCIP_SolOrigin = 0;
#[doc = "< all non-cached elements in solution are equal to zero"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_ZERO: SCIP_SolOrigin = 1;
#[doc = "< all non-cached elements in solution are equal to current LP solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_LPSOL: SCIP_SolOrigin = 2;
#[doc = "< all non-cached elements in solution are equal to current NLP solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_NLPSOL: SCIP_SolOrigin = 3;
#[doc = "< all non-cached elements in solution are equal to current relaxation solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_RELAXSOL: SCIP_SolOrigin = 4;
#[doc = "< all non-cached elements in solution are equal to current pseudo solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_PSEUDOSOL: SCIP_SolOrigin = 5;
#[doc = "< solution describes original solution; all non-cached elements in solution\n   are treated as being an arbitrary value in the variable's bounds"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_PARTIAL: SCIP_SolOrigin = 6;
#[doc = "< all non-cached elements in solution are unknown; they have to be treated\n   as being an arbitrary value in the variable's bounds"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_UNKNOWN: SCIP_SolOrigin = 7;
#[doc = " origin of solution: where to retrieve uncached elements"]
pub type SCIP_SolOrigin = ::std::os::raw::c_uint;
#[doc = " origin of solution: where to retrieve uncached elements"]
pub use self::SCIP_SolOrigin as SCIP_SOLORIGIN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Sol {
    _unused: [u8; 0],
}
pub type SCIP_SOL = SCIP_Sol;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Viol {
    _unused: [u8; 0],
}
pub type SCIP_VIOL = SCIP_Viol;
#[doc = "< type of solution unspecified (the default)"]
pub const SCIP_SolType_SCIP_SOLTYPE_UNKNOWN: SCIP_SolType = 0;
#[doc = "< solution was found by a heuristic"]
pub const SCIP_SolType_SCIP_SOLTYPE_HEUR: SCIP_SolType = 1;
#[doc = "< solution was found by a relaxation"]
pub const SCIP_SolType_SCIP_SOLTYPE_RELAX: SCIP_SolType = 2;
#[doc = "< solution was found by the LP relaxation"]
pub const SCIP_SolType_SCIP_SOLTYPE_LPRELAX: SCIP_SolType = 3;
#[doc = "< solution was found during strong branching"]
pub const SCIP_SolType_SCIP_SOLTYPE_STRONGBRANCH: SCIP_SolType = 4;
#[doc = "< solution originates from a pseudo solution"]
pub const SCIP_SolType_SCIP_SOLTYPE_PSEUDO: SCIP_SolType = 5;
#[doc = " type of solution: heuristic or (LP) relaxation solution, or unspecified origin"]
pub type SCIP_SolType = ::std::os::raw::c_uint;
#[doc = " type of solution: heuristic or (LP) relaxation solution, or unspecified origin"]
pub use self::SCIP_SolType as SCIP_SOLTYPE;
pub type SCIP_DIVETYPE = ::std::os::raw::c_uint;
#[doc = "< all contexts combined"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_TOTAL: SCIP_DiveContext = 0;
#[doc = "< single heuristic context"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_SINGLE: SCIP_DiveContext = 1;
#[doc = "< within adaptive diving"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_ADAPTIVE: SCIP_DiveContext = 2;
#[doc = "< within the scheduler heuristic"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_SCHEDULER: SCIP_DiveContext = 3;
#[doc = " context for diving statistics"]
pub type SCIP_DiveContext = ::std::os::raw::c_uint;
#[doc = " context for diving statistics"]
pub use self::SCIP_DiveContext as SCIP_DIVECONTEXT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Heur {
    _unused: [u8; 0],
}
pub type SCIP_HEUR = SCIP_Heur;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HeurData {
    _unused: [u8; 0],
}
pub type SCIP_HEURDATA = SCIP_HeurData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Diveset {
    _unused: [u8; 0],
}
pub type SCIP_DIVESET = SCIP_Diveset;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_VGraph {
    _unused: [u8; 0],
}
pub type SCIP_VGRAPH = SCIP_VGraph;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Conshdlr {
    _unused: [u8; 0],
}
pub type SCIP_CONSHDLR = SCIP_Conshdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Cons {
    _unused: [u8; 0],
}
pub type SCIP_CONS = SCIP_Cons;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConshdlrData {
    _unused: [u8; 0],
}
pub type SCIP_CONSHDLRDATA = SCIP_ConshdlrData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConsData {
    _unused: [u8; 0],
}
pub type SCIP_CONSDATA = SCIP_ConsData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConsSetChg {
    _unused: [u8; 0],
}
pub type SCIP_CONSSETCHG = SCIP_ConsSetChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_LinConsStats {
    _unused: [u8; 0],
}
pub type SCIP_LINCONSSTATS = SCIP_LinConsStats;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYM_Graph {
    _unused: [u8; 0],
}
pub type SYM_GRAPH = SYM_Graph;
#[doc = "< linear constraints with no variables"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_EMPTY: SCIP_LinConstype = 0;
#[doc = "< linear constraints with no finite side"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_FREE: SCIP_LinConstype = 1;
#[doc = "< linear constraints with a single variable"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SINGLETON: SCIP_LinConstype = 2;
#[doc = "< linear constraints of the type \\f$ ax + by = c\\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_AGGREGATION: SCIP_LinConstype = 3;
#[doc = "< linear constraints of the type \\f$ a x - a y \\leq b\\f$ where \\f$x\\f$ and \\f$y\\f$ must have the same type"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_PRECEDENCE: SCIP_LinConstype = 4;
#[doc = "< linear constraints of the form \\f$ ax + by \\leq c \\, x \\in \\{0,1\\} \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_VARBOUND: SCIP_LinConstype = 5;
#[doc = "< linear constraints of the form \\f$ \\sum x_i = 1\\, x_i \\in \\{0,1\\} \\forall i \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SETPARTITION: SCIP_LinConstype = 6;
#[doc = "< linear constraints of the form \\f$ \\sum x_i \\leq 1\\, x_i \\in \\{0,1\\} \\forall i \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SETPACKING: SCIP_LinConstype = 7;
#[doc = "< linear constraints of the form \\f$ \\sum x_i \\geq 1\\, x_i \\in \\{0,1\\} \\forall i \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SETCOVERING: SCIP_LinConstype = 8;
#[doc = "< linear constraints of the form \\f$ \\sum x_i = k\\, x_i \\in \\{0,1\\} \\forall i, \\, k\\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_CARDINALITY: SCIP_LinConstype = 9;
#[doc = "< linear constraints of the form \\f$ \\sum x_i \\leq b\\, x_i \\in \\{0,1\\} \\forall i, \\, b\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_INVKNAPSACK: SCIP_LinConstype = 10;
#[doc = "< linear constraints of the form \\f$ \\sum a_i x_i = b\\, x_i \\in \\{0,1\\} \\forall i, \\, b\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_EQKNAPSACK: SCIP_LinConstype = 11;
#[doc = "< linear constraints of the form \\f$ \\sum a_i x_i + a x \\leq a\\, x, x_i \\in \\{0,1\\} \\forall i, \\, a\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_BINPACKING: SCIP_LinConstype = 12;
#[doc = "< linear constraints of the form \\f$ \\sum a_k x_k \\leq b\\, x_i \\in \\{0,1\\} \\forall i, \\, b\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_KNAPSACK: SCIP_LinConstype = 13;
#[doc = "< linear constraints of the form \\f$ \\sum a_k x_k \\leq b\\, x_i \\in \\mathbb{Z} \\forall i, \\, b\\in \\mathbb{n} \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_INTKNAPSACK: SCIP_LinConstype = 14;
#[doc = "< linear constraints of the form \\f$ \\sum a_k x_k + \\sum p_j s_j \\leq/= b\\, x_i \\in \\{0,1\\} \\forall i, s_j \\in \\text{ cont. } \\forall j\\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_MIXEDBINARY: SCIP_LinConstype = 15;
#[doc = "< general linear constraints with no special structure"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_GENERAL: SCIP_LinConstype = 16;
#[doc = " linear constraint types recognizable"]
pub type SCIP_LinConstype = ::std::os::raw::c_uint;
#[doc = " linear constraint types recognizable"]
pub use self::SCIP_LinConstype as SCIP_LINCONSTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Dialog {
    _unused: [u8; 0],
}
pub type SCIP_DIALOG = SCIP_Dialog;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DialogData {
    _unused: [u8; 0],
}
pub type SCIP_DIALOGDATA = SCIP_DialogData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Dialoghdlr {
    _unused: [u8; 0],
}
pub type SCIP_DIALOGHDLR = SCIP_Dialoghdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Linelist {
    _unused: [u8; 0],
}
pub type SCIP_LINELIST = SCIP_Linelist;
#[doc = "< display column is not displayed"]
pub const SCIP_DispStatus_SCIP_DISPSTATUS_OFF: SCIP_DispStatus = 0;
#[doc = "< display column is switched on and off automatically"]
pub const SCIP_DispStatus_SCIP_DISPSTATUS_AUTO: SCIP_DispStatus = 1;
#[doc = "< display column is displayed"]
pub const SCIP_DispStatus_SCIP_DISPSTATUS_ON: SCIP_DispStatus = 2;
#[doc = " display activation status of display column"]
pub type SCIP_DispStatus = ::std::os::raw::c_uint;
#[doc = " display activation status of display column"]
pub use self::SCIP_DispStatus as SCIP_DISPSTATUS;
#[doc = "< display column is displayed only in sequential mode"]
pub const SCIP_DispMode_SCIP_DISPMODE_DEFAULT: SCIP_DispMode = 1;
#[doc = "< display column is displayed only in concurrent mode"]
pub const SCIP_DispMode_SCIP_DISPMODE_CONCURRENT: SCIP_DispMode = 2;
#[doc = "< display column is displayed in concurrent and sequential mode"]
pub const SCIP_DispMode_SCIP_DISPMODE_ALL: SCIP_DispMode = 3;
#[doc = " display activation status of display column"]
pub type SCIP_DispMode = ::std::os::raw::c_uint;
#[doc = " display activation status of display column"]
pub use self::SCIP_DispMode as SCIP_DISPMODE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Disp {
    _unused: [u8; 0],
}
pub type SCIP_DISP = SCIP_Disp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DispData {
    _unused: [u8; 0],
}
pub type SCIP_DISPDATA = SCIP_DispData;
#[doc = " interval given by infimum and supremum"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Interval {
    #[doc = "< infimum (lower bound) of interval"]
    pub inf: f64,
    #[doc = "< supremum (upper bound) of interval"]
    pub sup: f64,
}
#[test]
fn bindgen_test_layout_SCIP_Interval() {
    const UNINIT: ::std::mem::MaybeUninit<SCIP_Interval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCIP_Interval>(),
        16usize,
        concat!("Size of: ", stringify!(SCIP_Interval))
    );
    assert_eq!(
        ::std::mem::align_of::<SCIP_Interval>(),
        8usize,
        concat!("Alignment of ", stringify!(SCIP_Interval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_Interval),
            "::",
            stringify!(inf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sup) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_Interval),
            "::",
            stringify!(sup)
        )
    );
}
#[doc = " interval given by infimum and supremum"]
pub type SCIP_INTERVAL = SCIP_Interval;
#[doc = " rounding mode of floating point operations (upwards, downwards, nearest, ...)\n\n exact values depend on machine and compiler"]
pub type SCIP_ROUNDMODE = ::std::os::raw::c_int;
extern "C" {
    #[doc = " returns whether rounding mode control is available"]
    pub fn SCIPintervalHasRoundingControl() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " sets rounding mode of floating point operations"]
    pub fn SCIPintervalSetRoundingMode(roundmode: SCIP_ROUNDMODE);
}
extern "C" {
    #[doc = " gets current rounding mode of floating point operations"]
    pub fn SCIPintervalGetRoundingMode() -> SCIP_ROUNDMODE;
}
extern "C" {
    #[doc = " sets rounding mode of floating point operations to downwards rounding"]
    pub fn SCIPintervalSetRoundingModeDownwards();
}
extern "C" {
    #[doc = " sets rounding mode of floating point operations to upwards rounding"]
    pub fn SCIPintervalSetRoundingModeUpwards();
}
extern "C" {
    #[doc = " sets rounding mode of floating point operations to nearest rounding"]
    pub fn SCIPintervalSetRoundingModeToNearest();
}
extern "C" {
    #[doc = " sets rounding mode of floating point operations to towards zero rounding"]
    pub fn SCIPintervalSetRoundingModeTowardsZero();
}
extern "C" {
    #[doc = " negates a number in a way that the compiler does not optimize it away"]
    pub fn SCIPintervalNegateReal(x: f64) -> f64;
}
extern "C" {
    #[doc = " returns infimum of interval"]
    pub fn SCIPintervalGetInf(interval: SCIP_INTERVAL) -> f64;
}
extern "C" {
    #[doc = " returns supremum of interval"]
    pub fn SCIPintervalGetSup(interval: SCIP_INTERVAL) -> f64;
}
extern "C" {
    #[doc = " stores given value as interval"]
    pub fn SCIPintervalSet(resultant: *mut SCIP_INTERVAL, value: f64);
}
extern "C" {
    #[doc = " stores given infimum and supremum as interval"]
    pub fn SCIPintervalSetBounds(resultant: *mut SCIP_INTERVAL, inf: f64, sup: f64);
}
extern "C" {
    #[doc = " sets interval to empty interval, which will be [1.0, -1.0]"]
    pub fn SCIPintervalSetEmpty(resultant: *mut SCIP_INTERVAL);
}
extern "C" {
    #[doc = " indicates whether interval is empty, i.e., whether inf > sup"]
    pub fn SCIPintervalIsEmpty(infinity: f64, operand: SCIP_INTERVAL) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " sets interval to entire [-infinity, +infinity]"]
    pub fn SCIPintervalSetEntire(infinity: f64, resultant: *mut SCIP_INTERVAL);
}
extern "C" {
    #[doc = " indicates whether interval is entire, i.e., whether inf &le; -infinity and sup &ge; infinity"]
    pub fn SCIPintervalIsEntire(infinity: f64, operand: SCIP_INTERVAL) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " indicates whether interval is positive infinity, i.e., [infinity, infinity]"]
    pub fn SCIPintervalIsPositiveInfinity(
        infinity: f64,
        operand: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " indicates whether interval is negative infinity, i.e., [-infinity, -infinity]"]
    pub fn SCIPintervalIsNegativeInfinity(
        infinity: f64,
        operand: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " indicates whether operand1 is contained in operand2"]
    pub fn SCIPintervalIsSubsetEQ(
        infinity: f64,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " indicates whether operand1 and operand2 are disjoint"]
    pub fn SCIPintervalAreDisjoint(
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " indicates whether operand1 and operand2 are disjoint with epsilon tolerance\n\n Returns whether minimal (relative) distance of intervals is larger than epsilon.\n Same as `SCIPintervalIsEmpty(SCIPintervalIntersectEps(operand1, operand2))`."]
    pub fn SCIPintervalAreDisjointEps(
        eps: f64,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " intersection of two intervals"]
    pub fn SCIPintervalIntersect(
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " intersection of two intervals with epsilon tolerance\n\n If intersection of operand1 and operand2 is empty, but minimal (relative) distance of intervals\n is at most epsilon, then set resultant to singleton containing the point in operand1\n that is closest to operand2, i.e.,\n - `resultant = { operand1.sup }`, if `operand1.sup` < `operand2.inf` and `reldiff(operand2.inf,operand1.sup)` &le; eps\n - `resultant = { operand1.inf }`, if `operand1.inf` > `operand2.sup` and `reldiff(operand1.inf,operand2.sup)` &le; eps\n - `resultant` = intersection of `operand1` and `operand2`, otherwise"]
    pub fn SCIPintervalIntersectEps(
        resultant: *mut SCIP_INTERVAL,
        eps: f64,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " interval enclosure of the union of two intervals"]
    pub fn SCIPintervalUnify(
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " adds operand1 and operand2 and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalAddInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " adds operand1 and operand2 and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalAddSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " adds operand1 and operand2 and stores result in resultant"]
    pub fn SCIPintervalAdd(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " adds operand1 and scalar operand2 and stores result in resultant"]
    pub fn SCIPintervalAddScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " adds vector operand1 and vector operand2 and stores result in vector resultant"]
    pub fn SCIPintervalAddVectors(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " subtracts operand2 from operand1 and stores result in resultant"]
    pub fn SCIPintervalSub(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " subtracts scalar operand2 from operand1 and stores result in resultant"]
    pub fn SCIPintervalSubScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " multiplies operand1 with operand2 and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalMulInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " multiplies operand1 with operand2 and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalMulSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " multiplies operand1 with operand2 and stores result in resultant"]
    pub fn SCIPintervalMul(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " multiplies operand1 with scalar operand2 and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalMulScalarInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " multiplies operand1 with scalar operand2 and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalMulScalarSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " multiplies operand1 with scalar operand2 and stores result in resultant"]
    pub fn SCIPintervalMulScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " divides operand1 by operand2 and stores result in resultant"]
    pub fn SCIPintervalDiv(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " divides operand1 by scalar operand2 and stores result in resultant"]
    pub fn SCIPintervalDivScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " computes the scalar product of two vectors of intervals and stores result in resultant"]
    pub fn SCIPintervalScalprod(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " computes the scalar product of a vector of intervals and a vector of scalars and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalScalprodScalarsInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut f64,
    );
}
extern "C" {
    #[doc = " computes the scalar product of a vector of intervals and a vector of scalars and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalScalprodScalarsSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut f64,
    );
}
extern "C" {
    #[doc = " computes the scalar product of a vector of intervals and a vector of scalars and stores result in resultant"]
    pub fn SCIPintervalScalprodScalars(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut f64,
    );
}
extern "C" {
    #[doc = " squares operand and stores result in resultant"]
    pub fn SCIPintervalSquare(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores (positive part of) square root of operand in resultant\n @attention we assume a correctly rounded sqrt(double) function when rounding is to nearest"]
    pub fn SCIPintervalSquareRoot(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores operand1 to the power of operand2 in resultant\n\n uses SCIPintervalPowerScalar if operand2 is a scalar, otherwise computes exp(op2*log(op1))"]
    pub fn SCIPintervalPower(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores operand1 to the power of the scalar operand2 in resultant\n @attention we assume a correctly rounded pow(double) function when rounding is to nearest"]
    pub fn SCIPintervalPowerScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " stores bounds on the power of a scalar operand1 to a scalar operand2 in resultant\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 or operand2 integer and needs to have operand2 &ge; 0 if operand1 = 0.\n @attention we assume a correctly rounded pow(double) function when rounding is to nearest"]
    pub fn SCIPintervalPowerScalarScalar(
        resultant: *mut SCIP_INTERVAL,
        operand1: f64,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " computes lower bound on power of a scalar operand1 to an integer operand2\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 and need to have operand2 &ge; 0 if operand1 = 0."]
    pub fn SCIPintervalPowerScalarIntegerInf(operand1: f64, operand2: ::std::os::raw::c_int)
        -> f64;
}
extern "C" {
    #[doc = " computes upper bound on power of a scalar operand1 to an integer operand2\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 and needs to have operand2 &ge; 0 if operand1 = 0."]
    pub fn SCIPintervalPowerScalarIntegerSup(operand1: f64, operand2: ::std::os::raw::c_int)
        -> f64;
}
extern "C" {
    #[doc = " computes bounds on power of a scalar operand1 to an integer operand2\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 and needs to have operand2 &ge; 0 if operand1 = 0."]
    pub fn SCIPintervalPowerScalarInteger(
        resultant: *mut SCIP_INTERVAL,
        operand1: f64,
        operand2: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " given an interval for the image of a power operation, computes an interval for the origin\n\n That is, for \\f$y = x^p\\f$ with the exponent \\f$p\\f$ a given scalar and \\f$y\\f$ = `image` a given interval,\n computes \\f$x \\subseteq \\text{basedomain}\\f$ such that \\f$y \\in x^p\\f$ and such that for all \\f$z \\in \\text{basedomain} \\setminus x: z^p \\not \\in y\\f$."]
    pub fn SCIPintervalPowerScalarInverse(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        basedomain: SCIP_INTERVAL,
        exponent: f64,
        image: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores operand1 to the signed power of the scalar positive operand2 in resultant\n\n The signed power of x w.r.t. an exponent n &ge; 0 is given as \\f$\\mathrm{sign}(x) |x|^n\\f$.\n\n @attention we assume correctly rounded sqrt(double) and pow(double) functions when rounding is to nearest"]
    pub fn SCIPintervalSignPowerScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
extern "C" {
    #[doc = " computes the reciprocal of an interval"]
    pub fn SCIPintervalReciprocal(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores exponential of operand in resultant\n @attention we assume a correctly rounded exp(double) function when rounding is to nearest"]
    pub fn SCIPintervalExp(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores natural logarithm of operand in resultant\n @attention we assume a correctly rounded log(double) function when rounding is to nearest"]
    pub fn SCIPintervalLog(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores minimum of operands in resultant"]
    pub fn SCIPintervalMin(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores maximum of operands in resultant"]
    pub fn SCIPintervalMax(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores absolute value of operand in resultant"]
    pub fn SCIPintervalAbs(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores sine value of operand in resultant"]
    pub fn SCIPintervalSin(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores cosine value of operand in resultant"]
    pub fn SCIPintervalCos(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores sign of operand in resultant"]
    pub fn SCIPintervalSign(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
extern "C" {
    #[doc = " stores entropy of operand in resultant"]
    pub fn SCIPintervalEntropy(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " computes exact upper bound on \\f$ a x^2 + b x \\f$ for x in [xlb, xub], b an interval, and a scalar\n\n Uses Algorithm 2.2 from Domes and Neumaier: Constraint propagation on quadratic constraints (2008)."]
    pub fn SCIPintervalQuadUpperBound(
        infinity: f64,
        a: f64,
        b_: SCIP_INTERVAL,
        x: SCIP_INTERVAL,
    ) -> f64;
}
extern "C" {
    #[doc = " stores range of quadratic term in resultant\n\n given scalar a and intervals b and x, computes interval for \\f$ a x^2 + b x \\f$"]
    pub fn SCIPintervalQuad(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: f64,
        lincoeff: SCIP_INTERVAL,
        xrng: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " computes interval with positive solutions of a quadratic equation with interval coefficients\n\n Given intervals a, b, and c, this function computes an interval that contains all positive solutions of \\f$ a x^2 + b x \\in c\\f$ within xbnds."]
    pub fn SCIPintervalSolveUnivariateQuadExpressionPositive(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: SCIP_INTERVAL,
        lincoeff: SCIP_INTERVAL,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " computes interval with negative solutions of a quadratic equation with interval coefficients\n\n Given intervals a, b, and c, this function computes an interval that contains all negative solutions of \\f$ a x^2 + b x \\in c\\f$ within xbnds."]
    pub fn SCIPintervalSolveUnivariateQuadExpressionNegative(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: SCIP_INTERVAL,
        lincoeff: SCIP_INTERVAL,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " computes positive solutions of a quadratic equation with scalar coefficients\n\n Givens scalar a, b, and c, this function computes an interval that contains all positive solutions of \\f$ a x^2 + b x \\geq c\\f$ within xbnds.\n Implements Algorithm 3.2 from Domes and Neumaier: Constraint propagation on quadratic constraints (2008)."]
    pub fn SCIPintervalSolveUnivariateQuadExpressionPositiveAllScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: f64,
        lincoeff: f64,
        rhs: f64,
        xbnds: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " solves a quadratic equation with interval coefficients\n\n Given intervals a, b and c, this function computes an interval that contains all solutions of \\f$ a x^2 + b x \\in c\\f$ within xbnds."]
    pub fn SCIPintervalSolveUnivariateQuadExpression(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: SCIP_INTERVAL,
        lincoeff: SCIP_INTERVAL,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " stores range of bivariate quadratic term in resultant\n\n Given scalars \\f$a_x\\f$, \\f$a_y\\f$, \\f$a_{xy}\\f$, \\f$b_x\\f$, and \\f$b_y\\f$ and intervals for \\f$x\\f$ and \\f$y\\f$,\n computes interval for \\f$ a_x x^2 + a_y y^2 + a_{xy} x y + b_x x + b_y y \\f$.\n\n \\attention The operations are not applied rounding-safe here!"]
    pub fn SCIPintervalQuadBivar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        ax: f64,
        ay: f64,
        axy: f64,
        bx: f64,
        by: f64,
        xbnds: SCIP_INTERVAL,
        ybnds: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " solves a bivariate quadratic equation for the first variable\n\n Given scalars \\f$a_x\\f$, \\f$a_y\\f$, \\f$a_{xy}\\f$, \\f$b_x\\f$ and \\f$b_y\\f$, and intervals for \\f$x\\f$, \\f$y\\f$, and rhs,\n computes \\f$ \\{ x \\in \\mathbf{x} : \\exists y \\in \\mathbf{y} : a_x x^2 + a_y y^2 + a_{xy} x y + b_x x + b_y y \\in \\mathbf{\\mbox{rhs}} \\} \\f$.\n\n \\attention the operations are not applied rounding-safe here"]
    pub fn SCIPintervalSolveBivariateQuadExpressionAllScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        ax: f64,
        ay: f64,
        axy: f64,
        bx: f64,
        by: f64,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
        ybnds: SCIP_INTERVAL,
    );
}
extern "C" {
    #[doc = " propagates a weighted sum of intervals in a given interval\n\n Given \\f$\\text{constant} + \\sum_i \\text{weights}_i \\text{operands}_i \\in \\text{rhs}\\f$,\n computes possibly tighter interval for each term.\n\n @attention Valid values are returned in resultants only if any tightening has been found and no empty interval, that is, function returns with non-zero and `*infeasible` = FALSE.\n\n @return Number of terms for which resulting interval is smaller than operand interval."]
    pub fn SCIPintervalPropagateWeightedSum(
        infinity: f64,
        noperands: ::std::os::raw::c_int,
        operands: *mut SCIP_INTERVAL,
        weights: *mut f64,
        constant: f64,
        rhs: SCIP_INTERVAL,
        resultants: *mut SCIP_INTERVAL,
        infeasible: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRDATA = SCIP_ExprData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Expr {
    _unused: [u8; 0],
}
pub type SCIP_EXPR = SCIP_Expr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYM_ExprData {
    _unused: [u8; 0],
}
pub type SYM_EXPRDATA = SYM_ExprData;
#[doc = "< unknown or indefinite curvature"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_UNKNOWN: SCIP_EXPRCURV = 0;
#[doc = "< convex"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_CONVEX: SCIP_EXPRCURV = 1;
#[doc = "< concave"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_CONCAVE: SCIP_EXPRCURV = 2;
#[doc = "< linear = convex and concave"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_LINEAR: SCIP_EXPRCURV = 3;
#[doc = " curvature types"]
pub type SCIP_EXPRCURV = ::std::os::raw::c_uint;
#[doc = "< unknown or non-monotone"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_UNKNOWN: SCIP_MONOTONE = 0;
#[doc = "< increasing"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_INC: SCIP_MONOTONE = 1;
#[doc = "< decreasing"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_DEC: SCIP_MONOTONE = 2;
#[doc = "< constant = increasing and decreasing"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_CONST: SCIP_MONOTONE = 3;
#[doc = " monotonicity"]
pub type SCIP_MONOTONE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Expr_OwnerData {
    _unused: [u8; 0],
}
#[doc = "@name Expression Owner */\n/**@{"]
pub type SCIP_EXPR_OWNERDATA = SCIP_Expr_OwnerData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Exprhdlr {
    _unused: [u8; 0],
}
#[doc = "@name Expression Handler */\n/**@{"]
pub type SCIP_EXPRHDLR = SCIP_Exprhdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprhdlrData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRHDLRDATA = SCIP_ExprhdlrData;
#[doc = " stage of DFS iterator"]
pub type SCIP_EXPRITER_STAGE = ::std::os::raw::c_uint;
#[doc = " user data storage type for expression iteration"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union SCIP_EXPRITER_USERDATA {
    #[doc = "< a floating-point value"]
    pub realval: f64,
    #[doc = "< an integer value"]
    pub intval: ::std::os::raw::c_int,
    #[doc = "< two integer values"]
    pub intvals: [::std::os::raw::c_int; 2usize],
    #[doc = "< an unsigned integer value"]
    pub uintval: ::std::os::raw::c_uint,
    #[doc = "< a pointer"]
    pub ptrval: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SCIP_EXPRITER_USERDATA() {
    const UNINIT: ::std::mem::MaybeUninit<SCIP_EXPRITER_USERDATA> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCIP_EXPRITER_USERDATA>(),
        8usize,
        concat!("Size of: ", stringify!(SCIP_EXPRITER_USERDATA))
    );
    assert_eq!(
        ::std::mem::align_of::<SCIP_EXPRITER_USERDATA>(),
        8usize,
        concat!("Alignment of ", stringify!(SCIP_EXPRITER_USERDATA))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).realval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_EXPRITER_USERDATA),
            "::",
            stringify!(realval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_EXPRITER_USERDATA),
            "::",
            stringify!(intval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intvals) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_EXPRITER_USERDATA),
            "::",
            stringify!(intvals)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uintval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_EXPRITER_USERDATA),
            "::",
            stringify!(uintval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptrval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_EXPRITER_USERDATA),
            "::",
            stringify!(ptrval)
        )
    );
}
#[doc = "< reverse topological order"]
pub const SCIP_EXPRITER_TYPE_SCIP_EXPRITER_RTOPOLOGIC: SCIP_EXPRITER_TYPE = 0;
#[doc = "< breadth-first search"]
pub const SCIP_EXPRITER_TYPE_SCIP_EXPRITER_BFS: SCIP_EXPRITER_TYPE = 1;
#[doc = "< depth-first search"]
pub const SCIP_EXPRITER_TYPE_SCIP_EXPRITER_DFS: SCIP_EXPRITER_TYPE = 2;
#[doc = " mode for expression iterator"]
pub type SCIP_EXPRITER_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprIterData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRITERDATA = SCIP_ExprIterData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprIter {
    _unused: [u8; 0],
}
pub type SCIP_EXPRITER = SCIP_ExprIter;
pub type SCIP_EXPRPRINT_WHAT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprPrintData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRPRINTDATA = SCIP_ExprPrintData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Compr {
    _unused: [u8; 0],
}
pub type SCIP_COMPR = SCIP_Compr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ComprData {
    _unused: [u8; 0],
}
pub type SCIP_COMPRDATA = SCIP_ComprData;
#[doc = "< downwards branching: decreasing upper bound"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_DOWNWARDS: SCIP_BranchDir = 0;
#[doc = "< upwards branching: increasing lower bound"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_UPWARDS: SCIP_BranchDir = 1;
#[doc = "< fixed branching: both bounds changed"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_FIXED: SCIP_BranchDir = 2;
#[doc = "< automatic setting for choosing bound changes"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_AUTO: SCIP_BranchDir = 3;
#[doc = " branching direction for branching on variables"]
pub type SCIP_BranchDir = ::std::os::raw::c_uint;
#[doc = " branching direction for branching on variables"]
pub use self::SCIP_BranchDir as SCIP_BRANCHDIR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_History {
    _unused: [u8; 0],
}
pub type SCIP_HISTORY = SCIP_History;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ValueHistory {
    _unused: [u8; 0],
}
#[doc = " Value history data structure\n\n  branching and inference history informations for single variable dependent on the domain value\n\n  - \\ref SCIP_VALUEHISTORY \"List of all available methods\""]
pub type SCIP_VALUEHISTORY = SCIP_ValueHistory;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NodePQ {
    _unused: [u8; 0],
}
pub type SCIP_NODEPQ = SCIP_NodePQ;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Nodesel {
    _unused: [u8; 0],
}
pub type SCIP_NODESEL = SCIP_Nodesel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NodeselData {
    _unused: [u8; 0],
}
pub type SCIP_NODESELDATA = SCIP_NodeselData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Presol {
    _unused: [u8; 0],
}
pub type SCIP_PRESOL = SCIP_Presol;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PresolData {
    _unused: [u8; 0],
}
pub type SCIP_PRESOLDATA = SCIP_PresolData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Pricer {
    _unused: [u8; 0],
}
pub type SCIP_PRICER = SCIP_Pricer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PricerData {
    _unused: [u8; 0],
}
pub type SCIP_PRICERDATA = SCIP_PricerData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Reader {
    _unused: [u8; 0],
}
pub type SCIP_READER = SCIP_Reader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReaderData {
    _unused: [u8; 0],
}
pub type SCIP_READERDATA = SCIP_ReaderData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Relax {
    _unused: [u8; 0],
}
pub type SCIP_RELAX = SCIP_Relax;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Relaxation {
    _unused: [u8; 0],
}
pub type SCIP_RELAXATION = SCIP_Relaxation;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RelaxData {
    _unused: [u8; 0],
}
pub type SCIP_RELAXDATA = SCIP_RelaxData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Reopt {
    _unused: [u8; 0],
}
pub type SCIP_REOPT = SCIP_Reopt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SolTree {
    _unused: [u8; 0],
}
pub type SCIP_SOLTREE = SCIP_SolTree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SolNode {
    _unused: [u8; 0],
}
pub type SCIP_SOLNODE = SCIP_SolNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReoptTree {
    _unused: [u8; 0],
}
pub type SCIP_REOPTTREE = SCIP_ReoptTree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReoptNode {
    _unused: [u8; 0],
}
pub type SCIP_REOPTNODE = SCIP_ReoptNode;
pub type SCIP_REPRESENTATIVE = SCIP_ReoptNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReoptConsData {
    _unused: [u8; 0],
}
pub type SCIP_REOPTCONSDATA = SCIP_ReoptConsData;
#[doc = "< node is not part of the reoptimizationtree"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_NONE: SCIP_ReoptType = 0;
#[doc = "< node is only needed for reconstructing the tree"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_TRANSIT: SCIP_ReoptType = 1;
#[doc = "< node contains dual reductions which leed to LP infeasibility"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_INFSUBTREE: SCIP_ReoptType = 2;
#[doc = "< node contains dual reductions"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_STRBRANCHED: SCIP_ReoptType = 3;
#[doc = "< node contains additional constraints"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_LOGICORNODE: SCIP_ReoptType = 4;
#[doc = "< node is a leaf node"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_LEAF: SCIP_ReoptType = 5;
#[doc = "< node is a leaf node and pruned by boudning"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_PRUNED: SCIP_ReoptType = 6;
#[doc = "< node is a leaf node and has an integral optimal LP solution"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_FEASIBLE: SCIP_ReoptType = 7;
pub type SCIP_ReoptType = ::std::os::raw::c_uint;
pub use self::SCIP_ReoptType as SCIP_REOPTTYPE;
#[doc = "< constraint cutoffs an LP infeasible subtree"]
pub const Reopt_ConsType_REOPT_CONSTYPE_INFSUBTREE: Reopt_ConsType = 0;
#[doc = "< constraint reconstructs dual reductions"]
pub const Reopt_ConsType_REOPT_CONSTYPE_DUALREDS: Reopt_ConsType = 1;
#[doc = "< constraint representing a cut, e.g., to separate a solution"]
pub const Reopt_ConsType_REOPT_CONSTYPE_CUT: Reopt_ConsType = 2;
#[doc = "< constraint was added by SCIP, e.g., a (local) conflict"]
pub const Reopt_ConsType_REOPT_CONSTYPE_UNKNOWN: Reopt_ConsType = 3;
pub type Reopt_ConsType = ::std::os::raw::c_uint;
pub use self::Reopt_ConsType as REOPT_CONSTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Sepa {
    _unused: [u8; 0],
}
pub type SCIP_SEPA = SCIP_Sepa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SepaData {
    _unused: [u8; 0],
}
pub type SCIP_SEPADATA = SCIP_SepaData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Cutsel {
    _unused: [u8; 0],
}
pub type SCIP_CUTSEL = SCIP_Cutsel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_CutselData {
    _unused: [u8; 0],
}
pub type SCIP_CUTSELDATA = SCIP_CutselData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Table {
    _unused: [u8; 0],
}
pub type SCIP_TABLE = SCIP_Table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_TableData {
    _unused: [u8; 0],
}
pub type SCIP_TABLEDATA = SCIP_TableData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Prop {
    _unused: [u8; 0],
}
pub type SCIP_PROP = SCIP_Prop;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PropData {
    _unused: [u8; 0],
}
pub type SCIP_PROPDATA = SCIP_PropData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Nlpi {
    _unused: [u8; 0],
}
pub type SCIP_NLPI = SCIP_Nlpi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpiData {
    _unused: [u8; 0],
}
pub type SCIP_NLPIDATA = SCIP_NlpiData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpiProblem {
    _unused: [u8; 0],
}
pub type SCIP_NLPIPROBLEM = SCIP_NlpiProblem;
#[doc = "< never stop if progress is still possible"]
pub const SCIP_NlpParam_FastFail_SCIP_NLPPARAM_FASTFAIL_OFF: SCIP_NlpParam_FastFail = 0;
#[doc = "< stop if it seems unlikely that an improving point can be found"]
pub const SCIP_NlpParam_FastFail_SCIP_NLPPARAM_FASTFAIL_CONSERVATIVE: SCIP_NlpParam_FastFail = 1;
#[doc = "< stop if convergence rate is low"]
pub const SCIP_NlpParam_FastFail_SCIP_NLPPARAM_FASTFAIL_AGGRESSIVE: SCIP_NlpParam_FastFail = 2;
#[doc = " NLP solver fast-fail levels"]
pub type SCIP_NlpParam_FastFail = ::std::os::raw::c_uint;
#[doc = " NLP solver fast-fail levels"]
pub use self::SCIP_NlpParam_FastFail as SCIP_NLPPARAM_FASTFAIL;
#[doc = " parameters for NLP solve"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpParam {
    #[doc = "< lower objective limit (cutoff)"]
    pub lobjlimit: f64,
    #[doc = "< feasibility tolerance (maximal allowed absolute violation of constraints and variable bounds)"]
    pub feastol: f64,
    #[doc = "< optimality tolerance (maximal allowed absolute violation of optimality conditions)"]
    pub opttol: f64,
    #[doc = "< solver-specific tolerance on accuracy, e.g., maximal violation of feasibility and optimality in scaled problem (0.0: use solver default)"]
    pub solvertol: f64,
    #[doc = "< time limit in seconds: use SCIP_REAL_MAX to use remaining time available for SCIP solve (limits/time - currenttime)"]
    pub timelimit: f64,
    #[doc = "< iteration limit"]
    pub iterlimit: ::std::os::raw::c_int,
    #[doc = "< verbosity level of output of NLP solver to the screen: 0 off, 1 normal, 2 debug, > 2 more debug"]
    pub verblevel: ::std::os::raw::c_ushort,
    #[doc = "< whether the NLP solver should stop early if convergence is slow"]
    pub fastfail: SCIP_NLPPARAM_FASTFAIL,
    #[doc = "< whether to expect an infeasible problem"]
    pub expectinfeas: ::std::os::raw::c_uint,
    #[doc = "< whether to try to use solution of previous solve as starting point (if available)"]
    pub warmstart: ::std::os::raw::c_uint,
    #[doc = "< name of file from which NLP is solved (it's fine to set this to NULL)"]
    pub caller: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SCIP_NlpParam() {
    const UNINIT: ::std::mem::MaybeUninit<SCIP_NlpParam> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCIP_NlpParam>(),
        72usize,
        concat!("Size of: ", stringify!(SCIP_NlpParam))
    );
    assert_eq!(
        ::std::mem::align_of::<SCIP_NlpParam>(),
        8usize,
        concat!("Alignment of ", stringify!(SCIP_NlpParam))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lobjlimit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(lobjlimit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feastol) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(feastol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opttol) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(opttol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solvertol) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(solvertol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timelimit) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(timelimit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iterlimit) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(iterlimit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).verblevel) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(verblevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fastfail) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(fastfail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expectinfeas) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(expectinfeas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warmstart) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(warmstart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).caller) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpParam),
            "::",
            stringify!(caller)
        )
    );
}
#[doc = " parameters for NLP solve"]
pub type SCIP_NLPPARAM = SCIP_NlpParam;
#[doc = "< solved to global optimality"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_GLOBOPT: SCIP_NlpSolStat = 0;
#[doc = "< solved to local optimality"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_LOCOPT: SCIP_NlpSolStat = 1;
#[doc = "< feasible solution found"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_FEASIBLE: SCIP_NlpSolStat = 2;
#[doc = "< solution found is local infeasible"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_LOCINFEASIBLE: SCIP_NlpSolStat = 3;
#[doc = "< problem is proven infeasible"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_GLOBINFEASIBLE: SCIP_NlpSolStat = 4;
#[doc = "< problem is unbounded"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_UNBOUNDED: SCIP_NlpSolStat = 5;
#[doc = "< unknown solution status (e.g., problem not solved yet)"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_UNKNOWN: SCIP_NlpSolStat = 6;
#[doc = " NLP solution status"]
pub type SCIP_NlpSolStat = ::std::os::raw::c_uint;
#[doc = " NLP solution status"]
pub use self::SCIP_NlpSolStat as SCIP_NLPSOLSTAT;
#[doc = "< terminated successfully"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_OKAY: SCIP_NlpTermStat = 0;
#[doc = "< time limit exceeded"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_TIMELIMIT: SCIP_NlpTermStat = 1;
#[doc = "< iteration limit exceeded"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_ITERLIMIT: SCIP_NlpTermStat = 2;
#[doc = "< lower objective limit reached"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_LOBJLIMIT: SCIP_NlpTermStat = 3;
#[doc = "< SCIP has been asked to stop (SCIPinterruptSolve() called)"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_INTERRUPT: SCIP_NlpTermStat = 4;
#[doc = "< stopped on numerical error"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_NUMERICERROR: SCIP_NlpTermStat = 5;
#[doc = "< stopped on function evaluation error"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_EVALERROR: SCIP_NlpTermStat = 6;
#[doc = "< memory exceeded"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_OUTOFMEMORY: SCIP_NlpTermStat = 7;
#[doc = "< problems with license of NLP solver"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_LICENSEERROR: SCIP_NlpTermStat = 8;
#[doc = "< other error (= this should never happen)"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_OTHER: SCIP_NlpTermStat = 9;
#[doc = " NLP solver termination status"]
pub type SCIP_NlpTermStat = ::std::os::raw::c_uint;
#[doc = " NLP solver termination status"]
pub use self::SCIP_NlpTermStat as SCIP_NLPTERMSTAT;
#[doc = " Statistics from an NLP solve"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpStatistics {
    #[doc = "< number of iterations the NLP solver spend in the last solve command"]
    pub niterations: ::std::os::raw::c_int,
    #[doc = "< total time in CPU sections the NLP solver spend in the last solve command"]
    pub totaltime: f64,
    #[doc = "< time spend in evaluation of functions and their derivatives (only measured if timing/nlpieval = TRUE)"]
    pub evaltime: f64,
    #[doc = "< maximal absolute constraint violation in current solution, or SCIP_INVALID if not available"]
    pub consviol: f64,
    #[doc = "< maximal absolute variable bound violation in current solution, or SCIP_INVALID if not available"]
    pub boundviol: f64,
}
#[test]
fn bindgen_test_layout_SCIP_NlpStatistics() {
    const UNINIT: ::std::mem::MaybeUninit<SCIP_NlpStatistics> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCIP_NlpStatistics>(),
        40usize,
        concat!("Size of: ", stringify!(SCIP_NlpStatistics))
    );
    assert_eq!(
        ::std::mem::align_of::<SCIP_NlpStatistics>(),
        8usize,
        concat!("Alignment of ", stringify!(SCIP_NlpStatistics))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).niterations) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpStatistics),
            "::",
            stringify!(niterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).totaltime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpStatistics),
            "::",
            stringify!(totaltime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evaltime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpStatistics),
            "::",
            stringify!(evaltime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).consviol) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpStatistics),
            "::",
            stringify!(consviol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).boundviol) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SCIP_NlpStatistics),
            "::",
            stringify!(boundviol)
        )
    );
}
#[doc = " Statistics from an NLP solve"]
pub type SCIP_NLPSTATISTICS = SCIP_NlpStatistics;
#[doc = "< the solving status is not yet known"]
pub const SCIP_Status_SCIP_STATUS_UNKNOWN: SCIP_Status = 0;
#[doc = "< the user interrupted the solving process (by pressing CTRL-C)"]
pub const SCIP_Status_SCIP_STATUS_USERINTERRUPT: SCIP_Status = 1;
#[doc = "< the solving process was interrupted because the node limit was reached"]
pub const SCIP_Status_SCIP_STATUS_NODELIMIT: SCIP_Status = 2;
#[doc = "< the solving process was interrupted because the total node limit was\n   reached (incl. restarts)"]
pub const SCIP_Status_SCIP_STATUS_TOTALNODELIMIT: SCIP_Status = 3;
#[doc = "< the solving process was interrupted because the stalling node limit was\n   reached (no inprovement w.r.t. primal bound)"]
pub const SCIP_Status_SCIP_STATUS_STALLNODELIMIT: SCIP_Status = 4;
#[doc = "< the solving process was interrupted because the time limit was reached"]
pub const SCIP_Status_SCIP_STATUS_TIMELIMIT: SCIP_Status = 5;
#[doc = "< the solving process was interrupted because the memory limit was reached"]
pub const SCIP_Status_SCIP_STATUS_MEMLIMIT: SCIP_Status = 6;
#[doc = "< the solving process was interrupted because the gap limit was reached"]
pub const SCIP_Status_SCIP_STATUS_GAPLIMIT: SCIP_Status = 7;
#[doc = "< the solving process was interrupted because the solution limit was\n  reached"]
pub const SCIP_Status_SCIP_STATUS_SOLLIMIT: SCIP_Status = 8;
#[doc = "< the solving process was interrupted because the solution improvement limit\n   was reached"]
pub const SCIP_Status_SCIP_STATUS_BESTSOLLIMIT: SCIP_Status = 9;
#[doc = "< the solving process was interrupted because the restart limit was reached"]
pub const SCIP_Status_SCIP_STATUS_RESTARTLIMIT: SCIP_Status = 10;
#[doc = "< the problem was solved to optimality, an optimal solution is available"]
pub const SCIP_Status_SCIP_STATUS_OPTIMAL: SCIP_Status = 11;
#[doc = "< the problem was proven to be infeasible"]
pub const SCIP_Status_SCIP_STATUS_INFEASIBLE: SCIP_Status = 12;
#[doc = "< the problem was proven to be unbounded"]
pub const SCIP_Status_SCIP_STATUS_UNBOUNDED: SCIP_Status = 13;
#[doc = "< the problem was proven to be either infeasible or unbounded"]
pub const SCIP_Status_SCIP_STATUS_INFORUNBD: SCIP_Status = 14;
#[doc = "< status if the process received a SIGTERM signal"]
pub const SCIP_Status_SCIP_STATUS_TERMINATE: SCIP_Status = 15;
#[doc = " SCIP solving status"]
pub type SCIP_Status = ::std::os::raw::c_uint;
#[doc = " SCIP solving status"]
pub use self::SCIP_Status as SCIP_STATUS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Stat {
    _unused: [u8; 0],
}
pub type SCIP_STAT = SCIP_Stat;
pub const SCIP_Parallelmode_SCIP_PARA_OPPORTUNISTIC: SCIP_Parallelmode = 0;
pub const SCIP_Parallelmode_SCIP_PARA_DETERMINISTIC: SCIP_Parallelmode = 1;
#[doc = " The parallel mode"]
pub type SCIP_Parallelmode = ::std::os::raw::c_uint;
#[doc = " The parallel mode"]
pub use self::SCIP_Parallelmode as SCIP_PARALLELMODE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SyncStore {
    _unused: [u8; 0],
}
pub type SCIP_SYNCSTORE = SCIP_SyncStore;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SyncData {
    _unused: [u8; 0],
}
pub type SCIP_SYNCDATA = SCIP_SyncData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BoundStore {
    _unused: [u8; 0],
}
pub type SCIP_BOUNDSTORE = SCIP_BoundStore;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolverType {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVERTYPE = SCIP_ConcSolverType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolverTypeData {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVERTYPEDATA = SCIP_ConcSolverTypeData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolver {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVER = SCIP_ConcSolver;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolverData {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVERDATA = SCIP_ConcSolverData;
#[doc = "< the Benders' subproblems are solved during the enforcement of an LP solution"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_LP: SCIP_BendersEnfoType = 1;
#[doc = "< the Benders' subproblems are solved during the enforcement of a relaxation solution"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_RELAX: SCIP_BendersEnfoType = 2;
#[doc = "< the Benders' subproblems are solved during the enforcement of a pseudo solution"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_PSEUDO: SCIP_BendersEnfoType = 3;
#[doc = "< the Benders' subproblems are solved during the checking of a solution for feasibility"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_CHECK: SCIP_BendersEnfoType = 4;
pub type SCIP_BendersEnfoType = ::std::os::raw::c_uint;
pub use self::SCIP_BendersEnfoType as SCIP_BENDERSENFOTYPE;
#[doc = "< the relaxation is solved in this iteration of the loop"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_CONVEX: SCIP_BendersSolveLoop = 0;
#[doc = "< the CIP is solved in this iteration of the loop"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_CIP: SCIP_BendersSolveLoop = 1;
#[doc = "< the user defined solve function is called"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_USERCONVEX: SCIP_BendersSolveLoop = 2;
#[doc = "< the user defined solve function is called"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_USERCIP: SCIP_BendersSolveLoop = 3;
pub type SCIP_BendersSolveLoop = ::std::os::raw::c_uint;
pub use self::SCIP_BendersSolveLoop as SCIP_BENDERSSOLVELOOP;
#[doc = "< the subsystem status is unknown"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_UNKNOWN: SCIP_BendersSubStatus = 0;
#[doc = "< the subsystem is solved to be optimal"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_OPTIMAL: SCIP_BendersSubStatus = 1;
#[doc = "< the subproblem is optimal, but the auxiliary variable is violated"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_AUXVIOL: SCIP_BendersSubStatus = 2;
#[doc = "< the subproblem is solved to be infeasible"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_INFEAS: SCIP_BendersSubStatus = 3;
pub type SCIP_BendersSubStatus = ::std::os::raw::c_uint;
pub use self::SCIP_BendersSubStatus as SCIP_BENDERSSUBSTATUS;
#[doc = "< the subproblem has convex constraints and continuous variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_CONVEXCONT: SCIP_BendersSubType = 0;
#[doc = "< the subproblem has convex constraints and discrete variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_CONVEXDIS: SCIP_BendersSubType = 1;
#[doc = "< the subproblem has non-convex constraints and continuous variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_NONCONVEXCONT: SCIP_BendersSubType = 2;
#[doc = "< the subproblem has non-convex constraints and discrete variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_NONCONVEXDIS: SCIP_BendersSubType = 3;
#[doc = "< the default type before the type is known"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_UNKNOWN: SCIP_BendersSubType = 4;
pub type SCIP_BendersSubType = ::std::os::raw::c_uint;
pub use self::SCIP_BendersSubType as SCIP_BENDERSSUBTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Benders {
    _unused: [u8; 0],
}
pub type SCIP_BENDERS = SCIP_Benders;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BendersData {
    _unused: [u8; 0],
}
pub type SCIP_BENDERSDATA = SCIP_BendersData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SubproblemSolveStat {
    _unused: [u8; 0],
}
pub type SCIP_SUBPROBLEMSOLVESTAT = SCIP_SubproblemSolveStat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Benderscut {
    _unused: [u8; 0],
}
pub type SCIP_BENDERSCUT = SCIP_Benderscut;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BenderscutData {
    _unused: [u8; 0],
}
pub type SCIP_BENDERSCUTDATA = SCIP_BenderscutData;
extern "C" {
    #[doc = " create and resets an epsilon greedy bandit algorithm"]
    pub fn SCIPcreateBanditEpsgreedy(
        scip: *mut SCIP,
        epsgreedy: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        eps: f64,
        usemodification: ::std::os::raw::c_uint,
        preferrecent: ::std::os::raw::c_uint,
        decayfactor: f64,
        avglim: ::std::os::raw::c_int,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " get weights array of epsilon greedy bandit algorithm"]
    pub fn SCIPgetWeightsEpsgreedy(epsgreedy: *mut SCIP_BANDIT) -> *mut f64;
}
extern "C" {
    #[doc = " set epsilon parameter of epsilon greedy bandit algorithm"]
    pub fn SCIPsetEpsilonEpsgreedy(epsgreedy: *mut SCIP_BANDIT, eps: f64);
}
extern "C" {
    #[doc = " creates and resets an Exp.3 bandit algorithm using \\p scip pointer"]
    pub fn SCIPcreateBanditExp3(
        scip: *mut SCIP,
        exp3: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        gammaparam: f64,
        beta: f64,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " set gamma parameter of Exp.3 bandit algorithm to increase weight of uniform distribution"]
    pub fn SCIPsetGammaExp3(exp3: *mut SCIP_BANDIT, gammaparam: f64);
}
extern "C" {
    #[doc = " set beta parameter of Exp.3 bandit algorithm to increase gain offset for actions that were not played"]
    pub fn SCIPsetBetaExp3(exp3: *mut SCIP_BANDIT, beta: f64);
}
extern "C" {
    #[doc = " returns probability to play an action"]
    pub fn SCIPgetProbabilityExp3(exp3: *mut SCIP_BANDIT, action: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    #[doc = " creates and resets an Exp.3-IX bandit algorithm using \\p scip pointer"]
    pub fn SCIPcreateBanditExp3IX(
        scip: *mut SCIP,
        exp3ix: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " returns probability to play an action"]
    pub fn SCIPgetProbabilityExp3IX(exp3ix: *mut SCIP_BANDIT, action: ::std::os::raw::c_int)
        -> f64;
}
extern "C" {
    #[doc = " create and reset UCB bandit algorithm"]
    pub fn SCIPcreateBanditUcb(
        scip: *mut SCIP,
        ucb: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        alpha: f64,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " returns the upper confidence bound of a selected action"]
    pub fn SCIPgetConfidenceBoundUcb(ucb: *mut SCIP_BANDIT, action: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    #[doc = " return start permutation of the UCB bandit algorithm"]
    pub fn SCIPgetStartPermutationUcb(ucb: *mut SCIP_BANDIT) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " select the next action"]
    pub fn SCIPbanditSelect(
        bandit: *mut SCIP_BANDIT,
        action: *mut ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " update the score of the selected action"]
    pub fn SCIPbanditUpdate(
        bandit: *mut SCIP_BANDIT,
        action: ::std::os::raw::c_int,
        score: f64,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " return the name of this bandit virtual function table"]
    pub fn SCIPbanditvtableGetName(
        banditvtable: *mut SCIP_BANDITVTABLE,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " return the random number generator of a bandit algorithm"]
    pub fn SCIPbanditGetRandnumgen(bandit: *mut SCIP_BANDIT) -> *mut SCIP_RANDNUMGEN;
}
extern "C" {
    #[doc = " return number of actions of this bandit algorithm"]
    pub fn SCIPbanditGetNActions(bandit: *mut SCIP_BANDIT) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPbendersComp(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPbendersCompName(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets user data of Benders' decomposition"]
    pub fn SCIPbendersGetData(benders: *mut SCIP_BENDERS) -> *mut SCIP_BENDERSDATA;
}
extern "C" {
    #[doc = " sets user data of Benders' decomposition; user has to free old data in advance!"]
    pub fn SCIPbendersSetData(benders: *mut SCIP_BENDERS, bendersdata: *mut SCIP_BENDERSDATA);
}
extern "C" {
    #[doc = " gets name of Benders' decomposition"]
    pub fn SCIPbendersGetName(benders: *mut SCIP_BENDERS) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets description of Benders' decomposition"]
    pub fn SCIPbendersGetDesc(benders: *mut SCIP_BENDERS) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets priority of Benders' decomposition"]
    pub fn SCIPbendersGetPriority(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets the number of subproblems for the Benders' decomposition"]
    pub fn SCIPbendersGetNSubproblems(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns the SCIP instance for a given subproblem"]
    pub fn SCIPbendersSubproblem(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> *mut SCIP;
}
extern "C" {
    #[doc = " gets the number of times, the Bender' decomposition was called and tried to find a violated second stage constraint"]
    pub fn SCIPbendersGetNCalls(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets the number of optimality cuts found by the collection of Benders' decomposition subproblems"]
    pub fn SCIPbendersGetNCutsFound(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets the number of cuts found from the strengthening round"]
    pub fn SCIPbendersGetNStrengthenCutsFound(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets the number of calls to the strengthening round"]
    pub fn SCIPbendersGetNStrengthenCalls(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets the number of calls to the strengthening round that fail"]
    pub fn SCIPbendersGetNStrengthenFails(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets time in seconds used in this Benders' decomposition for setting up for next stages"]
    pub fn SCIPbendersGetSetupTime(benders: *mut SCIP_BENDERS) -> f64;
}
extern "C" {
    #[doc = " gets execution time in seconds used in this Benders' decomposition"]
    pub fn SCIPbendersGetTime(benders: *mut SCIP_BENDERS) -> f64;
}
extern "C" {
    #[doc = " Is Benders' decomposition initialized?"]
    pub fn SCIPbendersIsInitialized(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns whether the given Benders' decomposition is in use in the current problem"]
    pub fn SCIPbendersIsActive(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Returns whether only the convex relaxations will be checked in this solve loop\n  when Benders' is used in the LNS heuristics, only the convex relaxations of the master/subproblems are checked,\n  i.e. no integer cuts are generated. In this case, then Benders' decomposition is performed under the assumption\n  that all subproblems are convex relaxations."]
    pub fn SCIPbendersOnlyCheckConvexRelax(
        benders: *mut SCIP_BENDERS,
        subscipsoff: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns NLP solver parameters used for solving NLP subproblems"]
    pub fn SCIPbendersGetNLPParam(benders: *mut SCIP_BENDERS) -> SCIP_NLPPARAM;
}
extern "C" {
    #[doc = " Are Benders' cuts generated from the LP solutions?"]
    pub fn SCIPbendersCutLP(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Are Benders' cuts generated from the pseudo solutions?"]
    pub fn SCIPbendersCutPseudo(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Are Benders' cuts generated from the relaxation solutions?"]
    pub fn SCIPbendersCutRelaxation(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Should this Benders' use the auxiliary variables from the highest priority Benders'?"]
    pub fn SCIPbendersShareAuxVars(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " sets the subproblem setup flag"]
    pub fn SCIPbendersSetSubproblemIsSetup(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        issetup: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " returns the subproblem setup flag"]
    pub fn SCIPbendersSubproblemIsSetup(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns the auxiliary variable for the given subproblem"]
    pub fn SCIPbendersGetAuxiliaryVar(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> *mut SCIP_VAR;
}
extern "C" {
    #[doc = " returns all auxiliary variables"]
    pub fn SCIPbendersGetAuxiliaryVars(benders: *mut SCIP_BENDERS) -> *mut *mut SCIP_VAR;
}
extern "C" {
    #[doc = " stores the objective function value of the subproblem for use in cut generation"]
    pub fn SCIPbendersSetSubproblemObjval(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        objval: f64,
    );
}
extern "C" {
    #[doc = " returns the objective function value of the subproblem for use in cut generation"]
    pub fn SCIPbendersGetSubproblemObjval(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> f64;
}
extern "C" {
    #[doc = " returns the number of cuts that have been added for storage"]
    pub fn SCIPbendersGetNStoredCuts(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns the data for the cuts that have been added by the Benders' cut plugin"]
    pub fn SCIPbendersGetStoredCutData(
        benders: *mut SCIP_BENDERS,
        cutidx: ::std::os::raw::c_int,
        vars: *mut *mut *mut SCIP_VAR,
        vals: *mut *mut f64,
        lhs: *mut f64,
        rhs: *mut f64,
        nvars: *mut ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " returns the original problem data for the cuts that have been added by the Benders' cut plugin. The stored\n  variables and values will populate the input vars and vals arrays. Thus, memory must be allocated for the vars and\n  vals arrays"]
    pub fn SCIPbendersGetStoredCutOrigData(
        benders: *mut SCIP_BENDERS,
        cutidx: ::std::os::raw::c_int,
        vars: *mut *mut *mut SCIP_VAR,
        vals: *mut *mut f64,
        lhs: *mut f64,
        rhs: *mut f64,
        nvars: *mut ::std::os::raw::c_int,
        varssize: ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " returns the Benders' cut of the given name, or NULL if not existing"]
    pub fn SCIPfindBenderscut(
        benders: *mut SCIP_BENDERS,
        name: *const ::std::os::raw::c_char,
    ) -> *mut SCIP_BENDERSCUT;
}
extern "C" {
    #[doc = " returns the array of currently available Benders' cuts; active Benders' decomposition are in the first slots of\n the array"]
    pub fn SCIPbendersGetBenderscuts(benders: *mut SCIP_BENDERS) -> *mut *mut SCIP_BENDERSCUT;
}
extern "C" {
    #[doc = " returns the number of currently available Benders' cuts"]
    pub fn SCIPbendersGetNBenderscuts(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " sets the priority of a Benders' decomposition"]
    pub fn SCIPbendersSetBenderscutPriority(
        benders: *mut SCIP_BENDERS,
        benderscut: *mut SCIP_BENDERSCUT,
        priority: ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " returns whether the solution has non-zero slack variables"]
    pub fn SCIPbendersSolSlackVarsActive(
        benders: *mut SCIP_BENDERS,
        activeslack: *mut ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " sets the subproblem type\n\n The subproblem types are:\n    - Convex constraints with continuous variables\n    - Convex constraints with discrete variables\n    - Non-convex constraints with continuous variables\n    - Non-convex constraints with discrete variables"]
    pub fn SCIPbendersSetSubproblemType(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        subprobtype: SCIP_BENDERSSUBTYPE,
    );
}
extern "C" {
    #[doc = " returns the type of the subproblem\n\n  This type is used to determine whether the duals of the problem can be used to generate cuts"]
    pub fn SCIPbendersGetSubproblemType(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> SCIP_BENDERSSUBTYPE;
}
extern "C" {
    #[doc = " sets the flag indicating whether a subproblem is convex\n\n  It is possible that this can change during the solving process. One example is when the three-phase method is\n  employed, where the first phase solves the convex relaxation of both the master and subproblems, the second phase\n  reintroduces the integrality constraints to the master problem and the third phase then reintroduces integrality\n  constraints to the subproblems."]
    pub fn SCIPbendersSetSubproblemIsConvex(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        isconvex: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " returns whether the subproblem is convex\n\n  This means that the dual solution can be used to generate cuts."]
    pub fn SCIPbendersSubproblemIsConvex(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns the number of subproblems that are convex"]
    pub fn SCIPbendersGetNConvexSubproblems(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " sets the flag indicating whether a subproblem contains non-linear constraints"]
    pub fn SCIPbendersSetSubproblemIsNonlinear(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        isnonlinear: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " returns whether the subproblem contains non-linear constraints."]
    pub fn SCIPbendersSubproblemIsNonlinear(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns the number of subproblems that contain non-linear constraints"]
    pub fn SCIPbendersGetNNonlinearSubproblems(benders: *mut SCIP_BENDERS)
        -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " sets the flag indicating whether the master problem contains non-linear constraints"]
    pub fn SCIPbendersSetMasterIsNonlinear(
        benders: *mut SCIP_BENDERS,
        isnonlinear: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " returns whether the master problem contains non-linear constraints."]
    pub fn SCIPbendersMasterIsNonlinear(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns the flag indicating that Benders' decomposition is in a cut strengthening round"]
    pub fn SCIPbendersInStrengthenRound(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " solves the LP of the Benders' decomposition subproblem\n\n  This requires that the subproblem is in probing mode."]
    pub fn SCIPbendersSolveSubproblemLP(
        scip: *mut SCIP,
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        solvestatus: *mut SCIP_STATUS,
        objective: *mut f64,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " solves the Benders' decomposition subproblem"]
    pub fn SCIPbendersSolveSubproblemCIP(
        scip: *mut SCIP,
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        solvestatus: *mut SCIP_STATUS,
        solvecip: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " returns the number of cuts that have been transferred from sub SCIPs to the master SCIP"]
    pub fn SCIPbendersGetNTransferredCuts(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " updates the lower bound for the subproblem. If the lower bound is not greater than the previously stored lowerbound,\n then no update occurs."]
    pub fn SCIPbendersUpdateSubproblemLowerbound(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        lowerbound: f64,
    );
}
extern "C" {
    #[doc = " returns the stored lower bound for the given subproblem"]
    pub fn SCIPbendersGetSubproblemLowerbound(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> f64;
}
extern "C" {
    #[doc = " sets the independent subproblem flag"]
    pub fn SCIPbendersSetSubproblemIsIndependent(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        isindep: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " returns whether the subproblem is independent"]
    pub fn SCIPbendersSubproblemIsIndependent(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns whether the subproblem is enabled, i.e. the subproblem is still solved in the solving loop."]
    pub fn SCIPbendersSubproblemIsEnabled(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn SCIPbenderscutComp(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPbenderscutCompName(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets user data of the Benders' decomposition cut"]
    pub fn SCIPbenderscutGetData(benderscut: *mut SCIP_BENDERSCUT) -> *mut SCIP_BENDERSCUTDATA;
}
extern "C" {
    #[doc = " sets user data of the Benders' decomposition cut; user has to free old data in advance!"]
    pub fn SCIPbenderscutSetData(
        benderscut: *mut SCIP_BENDERSCUT,
        benderscutdata: *mut SCIP_BENDERSCUTDATA,
    );
}
extern "C" {
    #[doc = " gets name of the Benders' decomposition cut"]
    pub fn SCIPbenderscutGetName(benderscut: *mut SCIP_BENDERSCUT)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets description of the Benders' decomposition cut"]
    pub fn SCIPbenderscutGetDesc(benderscut: *mut SCIP_BENDERSCUT)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets priority of the Benders' decomposition cut"]
    pub fn SCIPbenderscutGetPriority(benderscut: *mut SCIP_BENDERSCUT) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets the number of times, the Benders' decomposition cut was called and tried to find a violated cut"]
    pub fn SCIPbenderscutGetNCalls(benderscut: *mut SCIP_BENDERSCUT) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the number of the cuts found by this Benders' decomposition cut"]
    pub fn SCIPbenderscutGetNFound(benderscut: *mut SCIP_BENDERSCUT) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " is the Benders' decomposition cut initialized?"]
    pub fn SCIPbenderscutIsInitialized(benderscut: *mut SCIP_BENDERSCUT) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " gets time in seconds used in this Benders' decomposition cut for setting up for next stages"]
    pub fn SCIPbenderscutGetSetupTime(benderscut: *mut SCIP_BENDERSCUT) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used in this Benders' decomposition cut"]
    pub fn SCIPbenderscutGetTime(benderscut: *mut SCIP_BENDERSCUT) -> f64;
}
extern "C" {
    #[doc = " returns whether the Benders' cut uses the LP information"]
    pub fn SCIPbenderscutIsLPCut(benderscut: *mut SCIP_BENDERSCUT) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " sets the enabled flag of the Benders' decomposition cut method"]
    pub fn SCIPbenderscutSetEnabled(
        benderscut: *mut SCIP_BENDERSCUT,
        enabled: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn SCIPbranchruleComp(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPbranchruleCompName(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets user data of branching rule"]
    pub fn SCIPbranchruleGetData(branchrule: *mut SCIP_BRANCHRULE) -> *mut SCIP_BRANCHRULEDATA;
}
extern "C" {
    #[doc = " sets user data of branching rule; user has to free old data in advance!"]
    pub fn SCIPbranchruleSetData(
        branchrule: *mut SCIP_BRANCHRULE,
        branchruledata: *mut SCIP_BRANCHRULEDATA,
    );
}
extern "C" {
    #[doc = " gets name of branching rule"]
    pub fn SCIPbranchruleGetName(branchrule: *mut SCIP_BRANCHRULE)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets description of branching rule"]
    pub fn SCIPbranchruleGetDesc(branchrule: *mut SCIP_BRANCHRULE)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets priority of branching rule"]
    pub fn SCIPbranchruleGetPriority(branchrule: *mut SCIP_BRANCHRULE) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets maximal depth level, up to which this branching rule should be used (-1 for no limit)"]
    pub fn SCIPbranchruleGetMaxdepth(branchrule: *mut SCIP_BRANCHRULE) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets maximal relative distance from current node's dual bound to primal bound for applying branching rule"]
    pub fn SCIPbranchruleGetMaxbounddist(branchrule: *mut SCIP_BRANCHRULE) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used in this branching rule for setting up for next stages"]
    pub fn SCIPbranchruleGetSetupTime(branchrule: *mut SCIP_BRANCHRULE) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used in this branching rule"]
    pub fn SCIPbranchruleGetTime(branchrule: *mut SCIP_BRANCHRULE) -> f64;
}
extern "C" {
    #[doc = " gets the total number of times, the branching rule was called on an LP solution"]
    pub fn SCIPbranchruleGetNLPCalls(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of times, the branching rule was called on external candidates"]
    pub fn SCIPbranchruleGetNExternCalls(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of times, the branching rule was called on a pseudo solution"]
    pub fn SCIPbranchruleGetNPseudoCalls(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of times, the branching rule detected a cutoff"]
    pub fn SCIPbranchruleGetNCutoffs(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of cuts, the branching rule separated"]
    pub fn SCIPbranchruleGetNCutsFound(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of constraints, the branching rule added to the respective local nodes (not counting constraints\n  that were added to the child nodes as branching decisions)"]
    pub fn SCIPbranchruleGetNConssFound(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of domain reductions, the branching rule found"]
    pub fn SCIPbranchruleGetNDomredsFound(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets the total number of children, the branching rule created"]
    pub fn SCIPbranchruleGetNChildren(
        branchrule: *mut SCIP_BRANCHRULE,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " is branching rule initialized?"]
    pub fn SCIPbranchruleIsInitialized(branchrule: *mut SCIP_BRANCHRULE) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn SCIPconflicthdlrComp(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPconflicthdlrCompName(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets user data of conflict handler"]
    pub fn SCIPconflicthdlrGetData(
        conflicthdlr: *mut SCIP_CONFLICTHDLR,
    ) -> *mut SCIP_CONFLICTHDLRDATA;
}
extern "C" {
    #[doc = " sets user data of conflict handler; user has to free old data in advance!"]
    pub fn SCIPconflicthdlrSetData(
        conflicthdlr: *mut SCIP_CONFLICTHDLR,
        conflicthdlrdata: *mut SCIP_CONFLICTHDLRDATA,
    );
}
extern "C" {
    #[doc = " gets name of conflict handler"]
    pub fn SCIPconflicthdlrGetName(
        conflicthdlr: *mut SCIP_CONFLICTHDLR,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets description of conflict handler"]
    pub fn SCIPconflicthdlrGetDesc(
        conflicthdlr: *mut SCIP_CONFLICTHDLR,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets priority of conflict handler"]
    pub fn SCIPconflicthdlrGetPriority(
        conflicthdlr: *mut SCIP_CONFLICTHDLR,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " is conflict handler initialized?"]
    pub fn SCIPconflicthdlrIsInitialized(
        conflicthdlr: *mut SCIP_CONFLICTHDLR,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " gets time in seconds used in this conflict handler for setting up for next stages"]
    pub fn SCIPconflicthdlrGetSetupTime(conflicthdlr: *mut SCIP_CONFLICTHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used in this conflict handler"]
    pub fn SCIPconflicthdlrGetTime(conflicthdlr: *mut SCIP_CONFLICTHDLR) -> f64;
}
extern "C" {
    pub fn SCIPconshdlrCompSepa(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPconshdlrCompEnfo(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPconshdlrCompCheck(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCIPconsCompCheck(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets name of constraint handler"]
    pub fn SCIPconshdlrGetName(conshdlr: *mut SCIP_CONSHDLR) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets description of constraint handler"]
    pub fn SCIPconshdlrGetDesc(conshdlr: *mut SCIP_CONSHDLR) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " gets user data of constraint handler"]
    pub fn SCIPconshdlrGetData(conshdlr: *mut SCIP_CONSHDLR) -> *mut SCIP_CONSHDLRDATA;
}
extern "C" {
    #[doc = " sets user data of constraint handler; user has to free old data in advance!"]
    pub fn SCIPconshdlrSetData(conshdlr: *mut SCIP_CONSHDLR, conshdlrdata: *mut SCIP_CONSHDLRDATA);
}
extern "C" {
    #[doc = " sets all separation related callbacks of the constraint handler"]
    pub fn SCIPconshdlrSetSepa(
        conshdlr: *mut SCIP_CONSHDLR,
        conssepalp: ::std::option::Option<
            unsafe extern "C" fn(
                scip: *mut SCIP,
                conshdlr: *mut SCIP_CONSHDLR,
                conss: *mut *mut SCIP_CONS,
                nconss: ::std::os::raw::c_int,
                nusefulconss: ::std::os::raw::c_int,
                result: *mut SCIP_RESULT,
            ) -> SCIP_RETCODE,
        >,
        conssepasol: ::std::option::Option<
            unsafe extern "C" fn(
                scip: *mut SCIP,
                conshdlr: *mut SCIP_CONSHDLR,
                conss: *mut *mut SCIP_CONS,
                nconss: ::std::os::raw::c_int,
                nusefulconss: ::std::os::raw::c_int,
                sol: *mut SCIP_SOL,
                result: *mut SCIP_RESULT,
            ) -> SCIP_RETCODE,
        >,
        sepafreq: ::std::os::raw::c_int,
        sepapriority: ::std::os::raw::c_int,
        delaysepa: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " sets both the propagation callback and the propagation frequency of the constraint handler"]
    pub fn SCIPconshdlrSetProp(
        conshdlr: *mut SCIP_CONSHDLR,
        consprop: ::std::option::Option<
            unsafe extern "C" fn(
                scip: *mut SCIP,
                conshdlr: *mut SCIP_CONSHDLR,
                conss: *mut *mut SCIP_CONS,
                nconss: ::std::os::raw::c_int,
                nusefulconss: ::std::os::raw::c_int,
                nmarkedconss: ::std::os::raw::c_int,
                proptiming: SCIP_PROPTIMING,
                result: *mut SCIP_RESULT,
            ) -> SCIP_RETCODE,
        >,
        propfreq: ::std::os::raw::c_int,
        delayprop: ::std::os::raw::c_uint,
        timingmask: SCIP_PROPTIMING,
    );
}
extern "C" {
    #[doc = " sets the relaxation enforcement method of the constraint handler"]
    pub fn SCIPconshdlrSetEnforelax(
        conshdlr: *mut SCIP_CONSHDLR,
        consenforelax: ::std::option::Option<
            unsafe extern "C" fn(
                scip: *mut SCIP,
                sol: *mut SCIP_SOL,
                conshdlr: *mut SCIP_CONSHDLR,
                conss: *mut *mut SCIP_CONS,
                nconss: ::std::os::raw::c_int,
                nusefulconss: ::std::os::raw::c_int,
                solinfeasible: ::std::os::raw::c_uint,
                result: *mut SCIP_RESULT,
            ) -> SCIP_RETCODE,
        >,
    );
}
extern "C" {
    #[doc = " gets array with constraints of constraint handler; the first SCIPconshdlrGetNActiveConss() entries are the active\n  constraints, the last SCIPconshdlrGetNConss() - SCIPconshdlrGetNActiveConss() constraints are deactivated\n\n  @note A constraint is active if it is global and was not removed or it was added locally (in that case the local\n        flag is TRUE) and the current node belongs to the corresponding sub tree."]
    pub fn SCIPconshdlrGetConss(conshdlr: *mut SCIP_CONSHDLR) -> *mut *mut SCIP_CONS;
}
extern "C" {
    #[doc = " gets array with enforced constraints of constraint handler; this is local information"]
    pub fn SCIPconshdlrGetEnfoConss(conshdlr: *mut SCIP_CONSHDLR) -> *mut *mut SCIP_CONS;
}
extern "C" {
    #[doc = " gets array with checked constraints of constraint handler; this is local information"]
    pub fn SCIPconshdlrGetCheckConss(conshdlr: *mut SCIP_CONSHDLR) -> *mut *mut SCIP_CONS;
}
extern "C" {
    #[doc = " gets array with delayed update constraints\n\n @attention Usually, there should be no need to access this array. Use this only if you are absolutely sure what you are doing."]
    pub fn SCIPconshdlrGetUpdateConss(conshdlr: *mut SCIP_CONSHDLR) -> *mut *mut SCIP_CONS;
}
extern "C" {
    #[doc = " gets total number of existing transformed constraints of constraint handler"]
    pub fn SCIPconshdlrGetNConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of enforced constraints of constraint handler; this is local information"]
    pub fn SCIPconshdlrGetNEnfoConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of checked constraints of constraint handler; this is local information"]
    pub fn SCIPconshdlrGetNCheckConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of active constraints of constraint handler\n\n  @note A constraint is active if it is global and was not removed or it was added locally (in that case the local\n        flag is TRUE) and the current node belongs to the corresponding sub tree."]
    pub fn SCIPconshdlrGetNActiveConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of enabled constraints of constraint handler"]
    pub fn SCIPconshdlrGetNEnabledConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of constraints that have delayed updates"]
    pub fn SCIPconshdlrGetNUpdateConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets time in seconds used for setting up this constraint handler for new stages"]
    pub fn SCIPconshdlrGetSetupTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for presolving in this constraint handler"]
    pub fn SCIPconshdlrGetPresolTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for separation in this constraint handler"]
    pub fn SCIPconshdlrGetSepaTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for LP enforcement in this constraint handler"]
    pub fn SCIPconshdlrGetEnfoLPTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for pseudo enforcement in this constraint handler"]
    pub fn SCIPconshdlrGetEnfoPSTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for relaxation enforcement in this constraint handler"]
    pub fn SCIPconshdlrGetEnfoRelaxTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for propagation in this constraint handler"]
    pub fn SCIPconshdlrGetPropTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for propagation in this constraint handler during strong branching"]
    pub fn SCIPconshdlrGetStrongBranchPropTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for feasibility checking in this constraint handler"]
    pub fn SCIPconshdlrGetCheckTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets time in seconds used for resolving propagation in this constraint handler"]
    pub fn SCIPconshdlrGetRespropTime(conshdlr: *mut SCIP_CONSHDLR) -> f64;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's separation method"]
    pub fn SCIPconshdlrGetNSepaCalls(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's LP enforcing method"]
    pub fn SCIPconshdlrGetNEnfoLPCalls(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's pseudo enforcing method"]
    pub fn SCIPconshdlrGetNEnfoPSCalls(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's relaxation enforcing method"]
    pub fn SCIPconshdlrGetNEnfoRelaxCalls(
        conshdlr: *mut SCIP_CONSHDLR,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's propagation method"]
    pub fn SCIPconshdlrGetNPropCalls(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's checking method"]
    pub fn SCIPconshdlrGetNCheckCalls(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of calls to the constraint handler's resolve propagation method"]
    pub fn SCIPconshdlrGetNRespropCalls(conshdlr: *mut SCIP_CONSHDLR)
        -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets total number of times, this constraint handler detected a cutoff"]
    pub fn SCIPconshdlrGetNCutoffs(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets total number of cuts found by this constraint handler"]
    pub fn SCIPconshdlrGetNCutsFound(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets total number of cuts found by this constraint handler applied to lp"]
    pub fn SCIPconshdlrGetNCutsApplied(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets total number of additional constraints added by this constraint handler"]
    pub fn SCIPconshdlrGetNConssFound(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets total number of domain reductions found by this constraint handler"]
    pub fn SCIPconshdlrGetNDomredsFound(conshdlr: *mut SCIP_CONSHDLR)
        -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets number of children created by this constraint handler"]
    pub fn SCIPconshdlrGetNChildren(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " gets maximum number of active constraints of constraint handler existing at the same time"]
    pub fn SCIPconshdlrGetMaxNActiveConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets initial number of active constraints of constraint handler"]
    pub fn SCIPconshdlrGetStartNActiveConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of variables fixed in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNFixedVars(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of variables aggregated in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNAggrVars(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of variable types changed in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNChgVarTypes(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of bounds changed in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNChgBds(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of holes added to domains of variables in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNAddHoles(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of constraints deleted in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNDelConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of constraints added in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNAddConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of constraints upgraded in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNUpgdConss(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of coefficients changed in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNChgCoefs(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of constraint sides changed in presolving method of constraint handler"]
    pub fn SCIPconshdlrGetNChgSides(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets number of times the presolving method of the constraint handler was called and tried to find reductions"]
    pub fn SCIPconshdlrGetNPresolCalls(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets separation priority of constraint handler"]
    pub fn SCIPconshdlrGetSepaPriority(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets enforcing priority of constraint handler"]
    pub fn SCIPconshdlrGetEnfoPriority(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets checking priority of constraint handler"]
    pub fn SCIPconshdlrGetCheckPriority(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets separation frequency of constraint handler"]
    pub fn SCIPconshdlrGetSepaFreq(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets propagation frequency of constraint handler"]
    pub fn SCIPconshdlrGetPropFreq(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " gets frequency of constraint handler for eager evaluations in separation, propagation and enforcement"]
    pub fn SCIPconshdlrGetEagerFreq(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " needs constraint handler a constraint to be called?"]
    pub fn SCIPconshdlrNeedsCons(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " does the constraint handler perform presolving?"]
    pub fn SCIPconshdlrDoesPresolve(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " should separation method be delayed, if other separators found cuts?"]
    pub fn SCIPconshdlrIsSeparationDelayed(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " should propagation method be delayed, if other propagators found reductions?"]
    pub fn SCIPconshdlrIsPropagationDelayed(conshdlr: *mut SCIP_CONSHDLR)
        -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " was LP separation method delayed at the last call?"]
    pub fn SCIPconshdlrWasLPSeparationDelayed(
        conshdlr: *mut SCIP_CONSHDLR,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " was primal solution separation method delayed at the last call?"]
    pub fn SCIPconshdlrWasSolSeparationDelayed(
        conshdlr: *mut SCIP_CONSHDLR,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " was propagation method delayed at the last call?"]
    pub fn SCIPconshdlrWasPropagationDelayed(
        conshdlr: *mut SCIP_CONSHDLR,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " is constraint handler initialized?"]
    pub fn SCIPconshdlrIsInitialized(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " does the constraint handler have a copy function?"]
    pub fn SCIPconshdlrIsClonable(conshdlr: *mut SCIP_CONSHDLR) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns the timing mask of the propagation method of the constraint handler"]
    pub fn SCIPconshdlrGetPropTiming(conshdlr: *mut SCIP_CONSHDLR) -> SCIP_PROPTIMING;
}
extern "C" {
    #[doc = " gets added constraints data for a constraint set change"]
    pub fn SCIPconssetchgGetAddedConsData(
        conssetchg: *mut SCIP_CONSSETCHG,
        conss: *mut *mut *mut SCIP_CONS,
        nconss: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " sets the timing mask of the propagation method of the constraint handler"]
    pub fn SCIPconshdlrSetPropTiming(conshdlr: *mut SCIP_CONSHDLR, proptiming: SCIP_PROPTIMING);
}
extern "C" {
    #[doc = " returns the timing mask of the presolving method of the constraint handler"]
    pub fn SCIPconshdlrGetPresolTiming(conshdlr: *mut SCIP_CONSHDLR) -> SCIP_PRESOLTIMING;
}
extern "C" {
    #[doc = " sets the timing mask of the presolving method of the constraint handler"]
    pub fn SCIPconshdlrSetPresolTiming(
        conshdlr: *mut SCIP_CONSHDLR,
        presoltiming: SCIP_PRESOLTIMING,
    );
}
extern "C" {
    #[doc = " returns whether conshdlr supports permutation symmetry detection"]
    pub fn SCIPconshdlrSupportsPermsymDetection(
        conshdlr: *mut SCIP_CONSHDLR,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns whether conshdlr supports signed permutation symmetry detection"]
    pub fn SCIPconshdlrSupportsSignedPermsymDetection(
        conshdlr: *mut SCIP_CONSHDLR,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns the name of the constraint\n\n  @note to change the name of a constraint, use SCIPchgConsName() from scip.h"]
    pub fn SCIPconsGetName(cons: *mut SCIP_CONS) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " returns the position of constraint in the corresponding handler's conss array"]
    pub fn SCIPconsGetPos(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns the constraint handler of the constraint"]
    pub fn SCIPconsGetHdlr(cons: *mut SCIP_CONS) -> *mut SCIP_CONSHDLR;
}
extern "C" {
    #[doc = " returns the constraint data field of the constraint"]
    pub fn SCIPconsGetData(cons: *mut SCIP_CONS) -> *mut SCIP_CONSDATA;
}
extern "C" {
    #[doc = " gets number of times, the constraint is currently captured"]
    pub fn SCIPconsGetNUses(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " for an active constraint, returns the depth in the tree at which the constraint was activated"]
    pub fn SCIPconsGetActiveDepth(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns the depth in the tree at which the constraint is valid; returns INT_MAX, if the constraint is local\n  and currently not active"]
    pub fn SCIPconsGetValidDepth(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is active in the current node"]
    pub fn SCIPconsIsActive(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint has to be deactivated in update phase"]
    pub fn SCIPconsIsUpdatedeactivate(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is enabled in the current node"]
    pub fn SCIPconsIsEnabled(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint's separation is enabled in the current node"]
    pub fn SCIPconsIsSeparationEnabled(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint's propagation is enabled in the current node"]
    pub fn SCIPconsIsPropagationEnabled(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is deleted or marked to be deleted"]
    pub fn SCIPconsIsDeleted(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is marked obsolete"]
    pub fn SCIPconsIsObsolete(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is marked as a conflict"]
    pub fn SCIPconsIsConflict(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " gets age of constraint"]
    pub fn SCIPconsGetAge(cons: *mut SCIP_CONS) -> f64;
}
extern "C" {
    #[doc = " returns TRUE iff the LP relaxation of constraint should be in the initial LP"]
    pub fn SCIPconsIsInitial(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint should be separated during LP processing"]
    pub fn SCIPconsIsSeparated(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint should be enforced during node processing"]
    pub fn SCIPconsIsEnforced(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint should be checked for feasibility"]
    pub fn SCIPconsIsChecked(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns whether the constraint is marked for propagation"]
    pub fn SCIPconsIsMarkedPropagate(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint should be propagated during node processing"]
    pub fn SCIPconsIsPropagated(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is globally valid"]
    pub fn SCIPconsIsGlobal(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is only locally valid or not added to any (sub)problem"]
    pub fn SCIPconsIsLocal(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is modifiable (subject to column generation)"]
    pub fn SCIPconsIsModifiable(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is subject to aging"]
    pub fn SCIPconsIsDynamic(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint's relaxation should be removed from the LP due to aging or cleanup"]
    pub fn SCIPconsIsRemovable(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint's relaxation should be removed from the LP due to aging or cleanup"]
    pub fn SCIPconsIsStickingAtNode(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint belongs to the global problem"]
    pub fn SCIPconsIsInProb(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is belonging to original space"]
    pub fn SCIPconsIsOriginal(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff constraint is belonging to transformed space"]
    pub fn SCIPconsIsTransformed(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff roundings for variables in constraint are locked"]
    pub fn SCIPconsIsLockedPos(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff roundings for variables in constraint's negation are locked"]
    pub fn SCIPconsIsLockedNeg(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff roundings for variables in constraint or in constraint's negation are locked"]
    pub fn SCIPconsIsLocked(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " get number of times the roundings for variables in constraint are locked"]
    pub fn SCIPconsGetNLocksPos(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " get number of times the roundings for variables in constraint's negation are locked"]
    pub fn SCIPconsGetNLocksNeg(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns TRUE iff roundings of the given locktype for variables in constraint are locked"]
    pub fn SCIPconsIsLockedTypePos(
        cons: *mut SCIP_CONS,
        locktype: SCIP_LOCKTYPE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff roundings of the given locktype for variables in constraint are locked"]
    pub fn SCIPconsIsLockedTypeNeg(
        cons: *mut SCIP_CONS,
        locktype: SCIP_LOCKTYPE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " returns TRUE iff roundings of the given locktype for variables in constraint or in constraint's negation are locked"]
    pub fn SCIPconsIsLockedType(
        cons: *mut SCIP_CONS,
        locktype: SCIP_LOCKTYPE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " get number of times the roundings of given locktype for variables in constraint are locked"]
    pub fn SCIPconsGetNLocksTypePos(
        cons: *mut SCIP_CONS,
        locktype: SCIP_LOCKTYPE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " get number of times the roundings of given locktype for variables in constraint's negation are locked"]
    pub fn SCIPconsGetNLocksTypeNeg(
        cons: *mut SCIP_CONS,
        locktype: SCIP_LOCKTYPE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns if the constraint was already added to a SCIP instance"]
    pub fn SCIPconsIsAdded(cons: *mut SCIP_CONS) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " adds locks to (dis-)allow upgrading of constraint"]
    pub fn SCIPconsAddUpgradeLocks(cons: *mut SCIP_CONS, nlocks: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " gets number of locks against upgrading the constraint, 0 means this constraint can be upgraded"]
    pub fn SCIPconsGetNUpgradeLocks(cons: *mut SCIP_CONS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " create linear constraint statistics"]
    pub fn SCIPlinConsStatsCreate(
        scip: *mut SCIP,
        linconsstats: *mut *mut SCIP_LINCONSSTATS,
    ) -> SCIP_RETCODE;
}
extern "C" {
    #[doc = " free linear constraint statistics"]
    pub fn SCIPlinConsStatsFree(scip: *mut SCIP, linconsstats: *mut *mut SCIP_LINCONSSTATS);
}
extern "C" {
    #[doc = " resets linear constraint statistics"]
    pub fn SCIPlinConsStatsReset(linconsstats: *mut SCIP_LINCONSSTATS);
}
extern "C" {
    #[doc = " returns the number of occurrences of a specific type of linear constraint"]
    pub fn SCIPlinConsStatsGetTypeCount(
        linconsstats: *mut SCIP_LINCONSSTATS,
        linconstype: SCIP_LINCONSTYPE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " returns the total number of classified constraints"]
    pub fn SCIPlinConsStatsGetSum(linconsstats: *mut SCIP_LINCONSSTATS) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " increases the number of occurrences of a specific type of linear constraint"]
    pub fn SCIPlinConsStatsIncTypeCount(
        linconsstats: *mut SCIP_LINCONSSTATS,
        linconstype: SCIP_LINCONSTYPE,
        increment: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " print linear constraint classification statistics"]
    pub fn SCIPprintLinConsStats(
        scip: *mut SCIP,
        file: *mut FILE,
        linconsstats: *mut SCIP_LINCONSSTATS,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Cutpool {
    _unused: [u8; 0],
}
pub type SCIP_CUTPOOL = SCIP_Cutpool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Cut {
    _unused: [u8; 0],
}
pub type SCIP_CUT = SCIP_Cut;
extern "C" {
    #[doc = " gets the row of the cut"]
    pub fn SCIPcutGetRow(cut: *mut SCIP_CUT) -> *mut SCIP_ROW;
}
extern "C" {
